------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  R:\B2\01 - Households\10 - Labour supply model\02 - Working area\02 - Training\EURO
> LAB 1.0\do\../log//7_predict_lt_2019_3ch.log
  log type:  text
 opened on:   6 Dec 2022, 21:43:16

. 
. use "${path_LSscen}/4_pred/${country}_${year}_${choices}ch_pred_LS.dta", clear 

. 
. capture drop *expe*  

. svyset psu1 [pw=dwt],strata(strata1)

Sampling weights: dwt
             VCE: linearized
     Single unit: missing
        Strata 1: strata1
 Sampling unit 1: psu1
           FPC 1: <zero>

. 
.  
. foreach s in "m" "f" {
  2.     quiet gen part_`s' = d_p_`s'
  3.         quiet gen  full_`s' = d_f_`s' 
  4.     quiet gen over_`s' = d_o_`s' 
  5.     quiet gen inwork_`s' = d_in_`s' 
  6.         quiet gen unemp_`s' = d_un_`s' 
  7.         quiet gen inactiv_`s' = d_out_`s'  
  8.         *quiet gen h_`s' = lhw_`s'
. }

.                         
. foreach ref in $reform_pred{
  2.         di in r "`ref'"
  3.         cap quiet  gen p_`ref' = 0
  4.         gen  cons_`ref' =.
  5. }
p2022_base
(66,952 missing values generated)
p2022_ba
(66,952 missing values generated)
p2022_bsa
(66,952 missing values generated)
p2022_tin
(66,952 missing values generated)
p2022_cb
(66,952 missing values generated)

. 
. 
. bys idperson: gen n =_n

. gen dwt_family = hhsize * dwt

. tempname dwt_sum_inflex

. sum dwt_family if flex_hh == 0 & n == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  dwt_family |          0

. scalar dwt_sum_inflex = r(sum)

. generate dwt_prob = 0

. replace dwt_prob = dwt_family if flex_hh == 0
(0 real changes made)

. 
. // Loop over HH type
. foreach type in "singf" "singm" "couples"  {
  2.         {
  3. 
.                 replace consum = 0
  4. 
.                 if "`type'" == "singf" {
  5.                         *preserve
.                         local minusg "m"
  6.                         local sex "f"
  7.                         local condition ""
  8.                         local hh "_hh"
  9.                         local condition "if inlist(flex_hh, 2) & flex_f == 1"
 10.                         local hstring "" 
 11.                         
.                         if $HOURS_DISTRIBUTION == 0 {
 12.                                   local hstring = string(lhw_f) /*in case of fixed hours al
> ternatives*/
 13.                         }
 14.                         
.                         if $HOURS_DISTRIBUTION == 1 {
 15.                                   local hstring = string(choice_hour_f) /*in case of random
>  hours alternatives*/
 16.                         }
 17.                         
.                         local max_scale 0.8
 18.                         local draw_cols 4
 19.                         local simfit_type "Single Women"
 20. 
.                 }
 21.                 if "`type'" == "singm" {
 22.                         *preserve
.                         local minusg "f"
 23.                         local sex "m"
 24.                         local condition "" 
 25.                         local hh "_hh"
 26.                         local condition "if inlist(flex_hh, 3) & flex_m == 1"
 27.                         local hstring "" 
 28.                         if $HOURS_DISTRIBUTION == 0 {
 29.                                  local hstring = string(lhw_m) /*in case of fixed hours alt
> ernatives*/
 30.                         }
 31.                         
.                         else {
 32.                                   local hstring = string(choice_hour_m) /*in case of random
>  hours alternatives*/
 33.                         }
 34.                         local max_scale 0.8
 35.                         local draw_cols 4
 36.                         local simfit_type "Single Men"
 37. 
.                 }
 38.                 if "`type'" == "couples"{
 39.                         *preserve
.                         local minusg ""
 40.                         local sex "m f"
 41.                         local condition ""
 42.                         local hh "_hh"
 43.                         local condition "if inlist(flex_hh, 1) & flex_m ==1"
 44.                         local hstring ""
 45.                         if $HOURS_DISTRIBUTION == 0 {
 46.                                   local hstring = "F" + string(lhw_f) + "  " + "M" + string
> (lhw_m) /*in case of fixed hours alternatives*/
 47.                         }
 48.                         
.                         else {
 49.                                   local hstring = "F" + string(choice_hour_f) + "  " + "M" 
> + string(choice_hour_m) /*in case of random hours alternatives*/
 50.                         }
 51. 
.                         local max_scale 0.6
 52.                         local draw_cols 3
 53.                         local simfit_type "Couples"             
 54.                 }
 55.                 local minusg ""
 56. 
.                 local reforms = subinstr("${reforms}","`minusg'","",1)
 57.                 
.                 di in r "`reforms'"
 58.                 local new_ref = subinstr("$reform_pred","p${ryear}_base","",.)
 59.                 di in r "`new_ref'"
 60.                         
.                 local hh "_hh"
 61. 
.                 estread using "${path_results}/estimation/${country}_${year}_clogit_`type'_${c
> hoices}ch.sters"
 62.                 estimates restore clogit_`type'_${country}_${year}
 63.                         
.                 //in this loop we       calculate choice probabilities
.                 
.                 foreach ref in $reform_pred{
 64.                         di "condition: `condition'"
 65. 
.                         // Reset consumption for prediction
.                         quiet  replace consum = max(ils_dispy_`ref'`hh' / 4.333, 0.01)  `condi
> tion'
 66.                         
.                         foreach var of varlist consum hhsize leis_m leis_f{
 67.                                 quiet  replace consum_`var' = `var'* consum `condition' 
 68.                         }
 69.                         predict p_`ref'_temp `condition'
 70.                         bysort idhh lhw_m_norand lhw_f_norand sec_m sec_f emp_stat_m emp_st
> at_f:  egen p_`ref'_max = total(p_`ref'_temp) `condition'
 71.                         replace p_`ref' = p_`ref'_max `condition'
 72.                         drop p_`ref'_max        p_`ref'_temp    
 73.                         
. 
.                         
.                         capture drop cons_`type'
 74.                         bys idhh:       egen  cons_`type' = total(consum * p_`ref')  `condi
> tion'
 75.                         replace cons_`ref' = cons_`type'  `condition'
 76.                         drop cons_`type'
 77.                 }
 78.                 
.                 //PREDICTED LABOUR SUPPLY
.                         
.                 egen N_`type' = count(ls) `condition' & ls ==1
 79.                 sum N_`type'
 80.                 
.                 replace dwt_prob = p_p${ryear}_base * dwt * hhsize  `condition'
 81.                 *replace dwt_prob = p_p${ryear}_base * dwt `condition'
.                 sum dwt_prob `condition'
 82. 
.                 global var_ls "part full over h inwork unemp inactiv"
 83.                 
.                 foreach ref in $reform_pred {
 84.                         foreach s in `sex' { 
 85.                                 foreach var in $var_ls {
 86.                                         if "`var'" != "h" {
 87.                                                 bys idhh:       egen `var'_`s'_`ref'_`type'
>  = total(`var'_`s' * p_`ref')  `condition'
 88.                                         }
 89.                                         if "`var'" == "h" {
 90.                                                 bys idhh:       egen `var'_`s'_`ref'_`type'
>  = total(`var'_`s' * p_`ref')  `condition'
 91.                                         }
 92.                                 }                       
 93.                         }
 94.                 }
 95. 
.                 // PREDICTED household monetary variable 
.                 local var_inc "dispy tax sic ben"
 96. 
.                 foreach ref in $reform_pred{ 
 97.                         foreach var in `var_inc'{ 
 98.                                 //here i generate the income concept at household level
.                                 bys idhh: egen `var'_`ref'_`type' = total(ils_`var'_`ref'_hh *
>  p_`ref')  `condition'
 99.                         }
100. 
.                         gen expend_`ref'_`type' = 12*ben_`ref'_`type'   `condition'
101.                         gen revenue_`ref'_`type' = 12*(tax_`ref'_`type'  +sic_`ref'_`type' 
> ) `condition'
102.                         gen net_expend_`ref'_`type' = revenue_`ref'_`type' - expend_`ref'_`
> type'   `condition'
103.                         sum net_expend_`ref'_`type' `condition'
104.                 }
105.                                 
.                 foreach ref in `new_ref'{
106.                         foreach var in `var_inc'{ 
107.                                 //here i genarate the income concept at household level
.                                 bys idhh: egen `var'_nb_`ref'_`type' = total(ils_`var'_`ref'_h
> h * p_p${ryear}_base)  `condition'
108.                         }
109.                 
.                         gen expend_nb_`ref'_`type' = 12*ben_nb_`ref'_`type'   `condition'
110.                         gen revenue_nb_`ref'_`type' = 12*(tax_nb_`ref'_`type'  +sic_nb_`ref
> '_`type' ) `condition'
111.                         gen net_expend_nb_`ref'_`type' = revenue_nb_`ref'_`type' - expend_n
> b_`ref'_`type'   `condition'
112.                         sum net_expend_nb_`ref'_`type' `condition'
113.                 }
114.                 
.                 ******************************************************************************
> *********
. 
.                 *restore
.                 tempname dwt_sum_`type'
115.                 sum dwt_prob `condition'
116.                 scalar dwt_sum_`type' = r(sum)
117.                 scalar list
118.         }
119.         
. 
. }
(66,952 real changes made)
base m f new
 p2022_ba p2022_bsa p2022_tin p2022_cb

----------------------------------------------------------------------------------------------
             |           Dependent  Number of        
        Name | Command    variable     param.  Title 
-------------+--------------------------------------------------------------------------------
clogit_~2019 | clogit           ls         17  Conditional (fixed-effects) logistic regression
----------------------------------------------------------------------------------------------
(results clogit_singf_lt_2019 are active now)
condition: if inlist(flex_hh, 2) & flex_f == 1
(option pc1 assumed; probability of success given one success within group)
(63,808 missing values generated)
(63,808 missing values generated)
(3,144 real changes made)
(63,808 missing values generated)
(3,144 real changes made)
condition: if inlist(flex_hh, 2) & flex_f == 1
(option pc1 assumed; probability of success given one success within group)
(63,808 missing values generated)
(63,808 missing values generated)
(3,144 real changes made)
(63,808 missing values generated)
(3,144 real changes made)
condition: if inlist(flex_hh, 2) & flex_f == 1
(option pc1 assumed; probability of success given one success within group)
(63,808 missing values generated)
(63,808 missing values generated)
(3,144 real changes made)
(63,808 missing values generated)
(3,144 real changes made)
condition: if inlist(flex_hh, 2) & flex_f == 1
(option pc1 assumed; probability of success given one success within group)
(63,808 missing values generated)
(63,808 missing values generated)
(3,144 real changes made)
(63,808 missing values generated)
(3,144 real changes made)
condition: if inlist(flex_hh, 2) & flex_f == 1
(option pc1 assumed; probability of success given one success within group)
(63,808 missing values generated)
(63,808 missing values generated)
(3,144 real changes made)
(63,808 missing values generated)
(3,144 real changes made)
(66,166 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     N_singf |        786         786           0        786        786
(3,144 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      3,144    116.4782    278.0223   1.04e-06   4166.017
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend~f |      3,144    3800.103    8153.567  -23823.77   42478.99
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_~a_singf |      3,144    3834.422    8151.808  -23915.51    42486.2
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net~sa_singf |      3,144     3754.13    8188.105  -24326.97   42478.99
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_~n_singf |      3,144    3499.532    7894.755  -23818.35   40217.74
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_~b_singf |      3,144    3740.335    8183.335   -24262.4   42478.99
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
n~nb_p2022~f |      3,144    3859.217    8134.613  -23798.64   42486.19
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |      3,144    3761.982    8182.848   -24281.1   42478.99
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |      3,144    3484.839    7899.895  -23827.37   40224.05
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |      3,144    3742.446    8181.613  -24222.42   42478.99

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      3,144    116.4782    278.0223   1.04e-06   4166.017
dwt_sum_singf =  366207.51
dwt_sum_inflex =          0
demand_tot_base =  937773.07
demand_d_U_base =          0
demand_d_I_base =    47730.1
demand_d_E_base =  890042.97
(3,144 real changes made)
base m f new
 p2022_ba p2022_bsa p2022_tin p2022_cb

----------------------------------------------------------------------------------------------
             |           Dependent  Number of        
        Name | Command    variable     param.  Title 
-------------+--------------------------------------------------------------------------------
clogit_~2019 | clogit           ls         17  Conditional (fixed-effects) logistic regression
----------------------------------------------------------------------------------------------
(results clogit_singm_lt_2019 are active now)
condition: if inlist(flex_hh, 3) & flex_m == 1
(option pc1 assumed; probability of success given one success within group)
(65,236 missing values generated)
(65,236 missing values generated)
(1,716 real changes made)
(65,236 missing values generated)
(1,716 real changes made)
condition: if inlist(flex_hh, 3) & flex_m == 1
(option pc1 assumed; probability of success given one success within group)
(65,236 missing values generated)
(65,236 missing values generated)
(1,716 real changes made)
(65,236 missing values generated)
(1,716 real changes made)
condition: if inlist(flex_hh, 3) & flex_m == 1
(option pc1 assumed; probability of success given one success within group)
(65,236 missing values generated)
(65,236 missing values generated)
(1,716 real changes made)
(65,236 missing values generated)
(1,716 real changes made)
condition: if inlist(flex_hh, 3) & flex_m == 1
(option pc1 assumed; probability of success given one success within group)
(65,236 missing values generated)
(65,236 missing values generated)
(1,716 real changes made)
(65,236 missing values generated)
(1,716 real changes made)
condition: if inlist(flex_hh, 3) & flex_m == 1
(option pc1 assumed; probability of success given one success within group)
(65,236 missing values generated)
(65,236 missing values generated)
(1,716 real changes made)
(65,236 missing values generated)
(1,716 real changes made)
(66,523 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
     N_singm |        429         429           0        429        429
(1,716 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      1,716    158.8207    443.9711   .0001464   11761.38
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend~m |      1,716    3056.834    7834.566  -28435.88   37501.97
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_~a_singm |      1,716     3088.14    7830.344  -28328.53   37473.68
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net~sa_singm |      1,716    3035.392    7848.398   -28740.8   37501.97
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_~n_singm |      1,716    2716.604    7521.096  -28672.57    34630.5
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_~b_singm |      1,716    3037.923    7837.502  -28728.25   37501.97
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |      1,716     3134.84    7808.748  -28369.38   37471.14
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |      1,716    3043.356    7845.754  -28713.08   37501.97
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |      1,716    2753.255    7592.407  -28619.98   34697.19
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |      1,716    3038.867    7838.201  -28701.68   37501.97

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      1,716    158.8207    443.9711   .0001464   11761.38
dwt_sum_singm =  272536.27
dwt_sum_singf =  366207.51
dwt_sum_inflex =          0
demand_tot_base =  937773.07
demand_d_U_base =          0
demand_d_I_base =    47730.1
demand_d_E_base =  890042.97
(1,716 real changes made)
base m f new
 p2022_ba p2022_bsa p2022_tin p2022_cb

----------------------------------------------------------------------------------------------
             |           Dependent  Number of        
        Name | Command    variable     param.  Title 
-------------+--------------------------------------------------------------------------------
clogit_~2019 | clogit           ls         32  Conditional (fixed-effects) logistic regression
----------------------------------------------------------------------------------------------
(results clogit_couples_lt_2019 are active now)
condition: if inlist(flex_hh, 1) & flex_m ==1
(option pc1 assumed; probability of success given one success within group)
(48,312 missing values generated)
(48,312 missing values generated)
(18,640 real changes made)
(48,312 missing values generated)
(18,640 real changes made)
condition: if inlist(flex_hh, 1) & flex_m ==1
(option pc1 assumed; probability of success given one success within group)
(48,312 missing values generated)
(48,312 missing values generated)
(18,640 real changes made)
(48,312 missing values generated)
(18,640 real changes made)
condition: if inlist(flex_hh, 1) & flex_m ==1
(option pc1 assumed; probability of success given one success within group)
(48,312 missing values generated)
(48,312 missing values generated)
(18,640 real changes made)
(48,312 missing values generated)
(18,640 real changes made)
condition: if inlist(flex_hh, 1) & flex_m ==1
(option pc1 assumed; probability of success given one success within group)
(48,312 missing values generated)
(48,312 missing values generated)
(18,640 real changes made)
(48,312 missing values generated)
(18,640 real changes made)
condition: if inlist(flex_hh, 1) & flex_m ==1
(option pc1 assumed; probability of success given one success within group)
(48,312 missing values generated)
(48,312 missing values generated)
(18,640 real changes made)
(48,312 missing values generated)
(18,640 real changes made)
(65,787 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   N_couples |      1,165        1165           0       1165       1165
(18,640 real changes made)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |     18,640    50.07565    222.2941   2.96e-07    6202.38
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend~s |     18,640    12552.47     11005.1   -20312.3    63255.1
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ne~a_couples |     18,640    12630.07    10968.87   -20318.6   63278.34
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
n~sa_couples |     18,640    12531.79    11025.54   -20312.3    63255.1
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ne~n_couples |     18,640    11849.99    10518.61  -20358.55   59449.64
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
ne~b_couples |     18,640    12464.44    11012.33   -20312.3    63255.1
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |     18,640    12652.88    10953.15     -20272   63273.73
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |     18,640    12535.47    11022.81   -20312.3    63255.1
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |     18,640    11848.29     10562.7  -20364.97   60332.78
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
net_expend.. |     18,640    12466.35    11014.69   -20312.3    63255.1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |     18,640    50.07565    222.2941   2.96e-07    6202.38
dwt_sum_couples =  933410.06
dwt_sum_singm =  272536.27
dwt_sum_singf =  366207.51
dwt_sum_inflex =          0
demand_tot_base =  937773.07
demand_d_U_base =          0
demand_d_I_base =    47730.1
demand_d_E_base =  890042.97

. 
. 
. save "${path_LSscen}/4_pred/${country}_${year}_${choices}ch_pred_LD.dta", replace
file ../data//LSscenarios//4_pred/lt_2019_3ch_pred_LD.dta saved

. 
. gen hhtype_ls = (inlist(flex_hh,2,4,6))*"singf" ///
>                 + (flex_hh==1)*"couples" ///
>                 + (inlist(flex_hh,3,5,7))*"singm" ///
>                 + (flex_hh==0)*"inflex" 

. 
. gen edstring = "H"*edc_H + "M"*edc_M + "L"*edc_L

. 
. 
. scalar summedtypes ///
>      = dwt_sum_singf + dwt_sum_couples + dwt_sum_singm + dwt_sum_inflex

. 
. 
. foreach type in "singf" "couples" "singm" "inflex" {
  2.     scalar `type'_share = dwt_sum_`type' / summedtypes    
  3. }

. 
. foreach s in "L" "M" "H" {
  2.         sum dwt_prob if edc_`s' == 1 & n == 1
  3.         scalar dwt_sum_`s' = r(sum)
  4.         *sum dwt_prob if edc_`s' == 1 & n == 1 & hh_recipient ==1
.         *scalar dwt_sum_`s' = r(sum)
. }

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      1,551    8.628544    72.32528          0   1453.778

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      2,704    26.02748    123.1265          0    2467.92

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      1,698    22.09681    122.8466          0   2316.843

. 
. 
. sum dwt_prob if n == 1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    dwt_prob |      5,953    20.37318    112.2542          0    2467.92

. scalar dwt_sum = r(sum)

. gen summedbyed = r(sum)

. 
. keep if ls == 1 
(63,407 observations deleted)

. 
. //the dummy all is to exclude flexible women in couple for not double counting these household
> s in calculation. 
. gen exclude = (flex_hh == 1& flex_f==1) 

. bys idhh: gen idhh_index = _n

. bys idhh:egen flex_hh_i = total(flex_hh)

. gen new_sel =  (exclude == 0) | (flex_hh_i ==0 & idhh_index == 1)

. //new_sel defines all households
. gen all = flex_f ==1|flex_m==1

. 
. local sex "m f"

. local var_ls = "h inwork unemp inactiv" 

.                 
. local sex "m f"

. foreach ref in $reform_pred{
  2.         foreach name in $var_ls{
  3.                 quietly gen `name'_`ref' = .
  4.                 foreach s in `sex'{ 
  5.                         bys idhh: egen `name'_`s'_`ref' = total(`name'_`s'_`ref'_couples)
  6.                         drop `name'_`s'_`ref'_couples
  7.                         quietly replace `name'_`ref' = `name'_`s'_`ref' if flex_hh == 1 & f
> lex_`s'==1
  8.                         quietly replace `name'_`ref' = `name'_`s'_`ref'_sing`s' if flex_`s'
>  ==1 & flex_hh!=1 
  9.                         drop `name'_`s'_`ref'_sing`s'           
 10.                 }
 11.         }                       
 12. }

.                                         
. local var_inc "dispy tax revenue expend net_expend"

. foreach ref in $reform_pred{ 
  2.         foreach var in `var_inc' { 
  3.                 quietly  gen `var'_`ref' = .
  4.                 quietly  replace  `var'_`ref' =  `var'_`ref'_couples
  5.                 drop `var'_`ref'_couples
  6.                 replace `var'_`ref' = `var'_`ref'_singm if `var'_`ref' == .  
  7.                 drop `var'_`ref'_singm
  8.                 replace `var'_`ref' = `var'_`ref'_singf if `var'_`ref' == . 
  9.                 drop `var'_`ref'_singf
 10.                 svy:total `var'_`ref'  if new_sel==1
 11.                 local `var'_`ref' = _b[`var'_`ref']
 12.                 di in r "``var'_`ref''"
 13.         }
 14. }
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
dispy_p2022_base |   1.16e+09   2.95e+07      1.10e+09    1.21e+09
------------------------------------------------------------------
1156816645.346956
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1            Number of obs   =      2,380
Number of PSUs   = 2,380            Population size = 649,076.53
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |      Total   std. err.     [95% conf. interval]
---------------+------------------------------------------------
tax_p2022_base |   2.59e+08    8555397      2.42e+08    2.75e+08
----------------------------------------------------------------
258523422.3260106
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
revenue_p2022_base |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
--------------------------------------------------------------------
7590966789.464157
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
expend_p2022_base |   2.23e+09   8.55e+07      2.06e+09    2.39e+09
-------------------------------------------------------------------
2225185901.07437
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                   Number of obs   =      2,380
Number of PSUs   = 2,380                   Population size = 649,076.53
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |      Total   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
net_expend_p2022_base |   5.37e+09   2.20e+08      4.93e+09    5.80e+09
-----------------------------------------------------------------------
5365780888.389786
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1            Number of obs   =      2,380
Number of PSUs   = 2,380            Population size = 649,076.53
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |      Total   std. err.     [95% conf. interval]
---------------+------------------------------------------------
dispy_p2022_ba |   1.15e+09   2.95e+07      1.09e+09    1.21e+09
----------------------------------------------------------------
1151832174.260079
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |      Total   std. err.     [95% conf. interval]
-------------+------------------------------------------------
tax_p2022_ba |   2.61e+08    8519817      2.44e+08    2.78e+08
--------------------------------------------------------------
261206771.3562666
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_ba |   7.62e+09   2.29e+08      7.17e+09    8.07e+09
------------------------------------------------------------------
7617238615.877567
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_ba |   2.23e+09   8.55e+07      2.06e+09    2.40e+09
-----------------------------------------------------------------
2228608204.486491
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_ba |   5.39e+09   2.20e+08      4.96e+09    5.82e+09
---------------------------------------------------------------------
5388630411.391075
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
dispy_p2022_bsa |   1.16e+09   2.95e+07      1.10e+09    1.22e+09
-----------------------------------------------------------------
1158140893.987593
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1           Number of obs   =      2,380
Number of PSUs   = 2,380           Population size = 649,076.53
                                   Design df       =      2,379

---------------------------------------------------------------
              |             Linearized
              |      Total   std. err.     [95% conf. interval]
--------------+------------------------------------------------
tax_p2022_bsa |   2.58e+08    8555347      2.42e+08    2.75e+08
---------------------------------------------------------------
258462550.1957264
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_bsa |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
-------------------------------------------------------------------
7588762882.972107
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_bsa |   2.25e+09   8.63e+07      2.08e+09    2.41e+09
------------------------------------------------------------------
2245089221.246431
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      2,380
Number of PSUs   = 2,380                  Population size = 649,076.53
                                          Design df       =      2,379

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_bsa |   5.34e+09   2.21e+08      4.91e+09    5.78e+09
----------------------------------------------------------------------
5343673661.725674
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
dispy_p2022_tin |   1.18e+09   3.03e+07      1.12e+09    1.24e+09
-----------------------------------------------------------------
1183673492.653537
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1           Number of obs   =      2,380
Number of PSUs   = 2,380           Population size = 649,076.53
                                   Design df       =      2,379

---------------------------------------------------------------
              |             Linearized
              |      Total   std. err.     [95% conf. interval]
--------------+------------------------------------------------
tax_p2022_tin |   2.31e+08    7644213      2.16e+08    2.46e+08
---------------------------------------------------------------
231293942.9852426
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_tin |   7.26e+09   2.18e+08      6.84e+09    7.69e+09
-------------------------------------------------------------------
7263679830.348495
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_tin |   2.22e+09   8.53e+07      2.05e+09    2.39e+09
------------------------------------------------------------------
2221377130.015399
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      2,380
Number of PSUs   = 2,380                  Population size = 649,076.53
                                          Design df       =      2,379

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_tin |   5.04e+09   2.10e+08      4.63e+09    5.45e+09
----------------------------------------------------------------------
5042302700.333095
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1            Number of obs   =      2,380
Number of PSUs   = 2,380            Population size = 649,076.53
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |      Total   std. err.     [95% conf. interval]
---------------+------------------------------------------------
dispy_p2022_cb |   1.16e+09   2.96e+07      1.10e+09    1.22e+09
----------------------------------------------------------------
1160527416.326764
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |      Total   std. err.     [95% conf. interval]
-------------+------------------------------------------------
tax_p2022_cb |   2.58e+08    8554213      2.42e+08    2.75e+08
--------------------------------------------------------------
258487434.6733831
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_cb |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
------------------------------------------------------------------
7589985577.138883
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_cb |   2.27e+09   8.69e+07      2.10e+09    2.44e+09
-----------------------------------------------------------------
2271206354.219639
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_cb |   5.32e+09   2.20e+08      4.89e+09    5.75e+09
---------------------------------------------------------------------
5318779222.919243

.                 
. foreach ref in  `new_ref'{ 
  2.         foreach var in `var_inc' { 
  3.                 quietly  gen `var'_nb_`ref' = .
  4.                 quietly  replace  `var'_nb_`ref' =  `var'_nb_`ref'_couples
  5.                 drop `var'_nb_`ref'_couples
  6.                 replace `var'_nb_`ref' = `var'_nb_`ref'_singm if `var'_nb_`ref' == .  
  7.                 drop `var'_nb_`ref'_singm
  8.                 replace `var'_nb_`ref' = `var'_nb_`ref'_singf if `var'_nb_`ref' == . 
  9.                 drop `var'_nb_`ref'_singf
 10.                 svy:total `var'_nb_`ref'  if new_sel==1
 11.                 local `var'_nb_`ref' = _b[`var'_nb_`ref']
 12.                 di in r "``var'_nb_`ref''"
 13.         }
 14. }
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
dispy_nb_p2022_ba |   1.15e+09   2.95e+07      1.10e+09    1.21e+09
-------------------------------------------------------------------
1153417509.948475
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
tax_nb_p2022_ba |   2.62e+08    8516255      2.45e+08    2.79e+08
-----------------------------------------------------------------
261922544.4650285
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
revenue_nb_p2022_ba |   7.63e+09   2.29e+08      7.18e+09    8.08e+09
---------------------------------------------------------------------
7631756255.13237
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
expend_nb_p2022_ba |   2.23e+09   8.55e+07      2.06e+09    2.39e+09
--------------------------------------------------------------------
2225185901.07437
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                    Number of obs   =      2,380
Number of PSUs   = 2,380                    Population size = 649,076.53
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |      Total   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
net_expend_nb_p2022_ba |   5.41e+09   2.20e+08      4.97e+09    5.84e+09
------------------------------------------------------------------------
5406570354.058002
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
dispy_nb_p2022_bsa |   1.16e+09   2.95e+07      1.10e+09    1.22e+09
--------------------------------------------------------------------
1158356033.417245
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
tax_nb_p2022_bsa |   2.59e+08    8555397      2.42e+08    2.75e+08
------------------------------------------------------------------
258523422.3260106
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      2,380
Number of PSUs   = 2,380                  Population size = 649,076.53
                                          Design df       =      2,379

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
revenue_nb_p2022_bsa |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
----------------------------------------------------------------------
7590966789.464157
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
expend_nb_p2022_bsa |   2.24e+09   8.63e+07      2.07e+09    2.41e+09
---------------------------------------------------------------------
2243658621.388823
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                     Number of obs   =      2,380
Number of PSUs   = 2,380                     Population size = 649,076.53
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |      Total   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
net_expend_nb_p2022_bsa |   5.35e+09   2.21e+08      4.91e+09    5.78e+09
-------------------------------------------------------------------------
5347308168.075335
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
dispy_nb_p2022_tin |   1.18e+09   3.03e+07      1.12e+09    1.24e+09
--------------------------------------------------------------------
1183765980.6576
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
tax_nb_p2022_tin |   2.31e+08    7656477      2.16e+08    2.46e+08
------------------------------------------------------------------
231366077.1637357
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      2,380
Number of PSUs   = 2,380                  Population size = 649,076.53
                                          Design df       =      2,379

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
revenue_nb_p2022_tin |   7.27e+09   2.18e+08      6.84e+09    7.69e+09
----------------------------------------------------------------------
7265078647.516857
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
expend_nb_p2022_tin |   2.22e+09   8.54e+07      2.06e+09    2.39e+09
---------------------------------------------------------------------
2222692148.158607
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                     Number of obs   =      2,380
Number of PSUs   = 2,380                     Population size = 649,076.53
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |      Total   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
net_expend_nb_p2022_tin |   5.04e+09   2.11e+08      4.63e+09    5.46e+09
-------------------------------------------------------------------------
5042386499.35825
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
dispy_nb_p2022_cb |   1.16e+09   2.96e+07      1.10e+09    1.22e+09
-------------------------------------------------------------------
1160653193.470149
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
tax_nb_p2022_cb |   2.59e+08    8555397      2.42e+08    2.75e+08
-----------------------------------------------------------------
258523422.3260106
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
revenue_nb_p2022_cb |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
---------------------------------------------------------------------
7590966789.464157
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
expend_nb_p2022_cb |   2.27e+09   8.69e+07      2.10e+09    2.44e+09
--------------------------------------------------------------------
2271222230.728813
(429 real changes made)
(786 real changes made)
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                    Number of obs   =      2,380
Number of PSUs   = 2,380                    Population size = 649,076.53
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |      Total   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
net_expend_nb_p2022_cb |   5.32e+09   2.20e+08      4.89e+09    5.75e+09
------------------------------------------------------------------------
5319744558.735345

. 
. 
. *------ Generate table 7_predict_template --------------------------------------
. local filename="${path_results2share}/${country}_${year}_${choices}ch/3-Behavioral_effect_new_
> reform.xlsx"

. copy "7_predict_template.xlsx" "`filename'", replace
(file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx not found)

. 
. *- Table 1: Total Revenue and Expenditures with behavioural and non behavioural labour supply 
> responses         
. //HHtype: Total, Couples (1), Single Women (2), Single men (3), Sole parents (23)       
. gen main_hh =0

. replace main_hh = 1 if hhtype ==11|hhtype ==12
(2,330 real changes made)

. replace main_hh = 2 if hhtype ==21|hhtype ==22
(786 real changes made)

. replace main_hh = 3 if hhtype ==31|hhtype ==32
(429 real changes made)

. replace main_hh = 4 if hhtype == 21|hhtype == 31
(274 real changes made)

. 
. *- Define initial column and row to write results in excel sheet
. local col_i=3                           

. local row_i=6                           //To write values

. local row_0=`row_i' - 2         //To write labels

. local ref_col=1

. 
. 
. *- Calculations and Results Table 1
. putexcel set "`filename'", modify sheet("Tax and Transfers")

. foreach ref in $reform_pred{ 
  2. 
.         *- Calculate total
.         local var_inc "revenue expend net_expend"
  3.         local counter=1
  4.         mat M_total_`ref'=J(3,1,.)
  5.         foreach var in `var_inc'{
  6.                 foreach type in "1" "2" "3" "4"{
  7.                         svy:total `var'_`ref'  if new_sel==1 & main_hh ==`type'
  8.                         scalar `var'_`ref'_`type' = _b[`var'_`ref']
  9.                         scalar list `var'_`ref'_`type'
 10.                         
.                         if `counter'==1{
 11.                                 mat M_`ref'_`type'= `var'_`ref'_`type'
 12.                         }
 13.                         else{
 14.                                 mat aux= `var'_`ref'_`type'
 15.                                 mat M_`ref'_`type'=(M_`ref'_`type'\aux)
 16.                         }
 17.                 }
 18.                         
.                 svy:total `var'_`ref'  if new_sel==1 
 19.                 scalar `var'_`ref' = _b[`var'_`ref']
 20.                 local `var'_`ref' = _b[`var'_`ref']
 21.                 scalar list `var'_`ref'
 22.                 di in r "`var'_`ref'"
 23.                 mat M_total_`ref'[`counter',1]=`var'_`ref'
 24.                 local ++counter
 25.         }
 26.         
.         mat M_`ref'=(M_total_`ref'\J(2,1,.)\M_`ref'_1\J(2,1,.)\M_`ref'_3\J(2,1,.)\M_`ref'_2\J(
> 2,1,.)\M_`ref'_4)
 27.         
.         *- Write values in excel sheet 
.         if regexm("`ref'","base") {
 28.                 local baseline_name="`ref'"
 29.                 local col_f=char(64 + `col_i')
 30.                 mat M_base=M_`ref'
 31.                 
.                 *- Write Abs. value and % Change
.                 putexcel `col_f'`row_i' = matrix(M_`ref')
 32.                 putexcel `col_f'`row_0' = "Baseline"
 33.         }
 34.         else{
 35.                 local ref_col=`ref_col' + 3
 36.                 local col_f=char(64 + `ref_col')
 37.                 mat M_diff=(M_`ref' - M_base)   //Absolute difference
 38.                 
.                 mat M_diff_percent=J(23,1,.)
 39.                 forvalues i = 1/23 {
 40.                         mat M_diff_percent[`i',1] = M_diff[`i',1]/M_base[`i',1] //% Differe
> nce
 41.                 }
 42.                 mat M_full=(M_`ref',M_diff_percent)
 43. 
.                 *- Write Abs. value and % Change
.                 local ref_name="Reform " + substr("`ref'",7,strlen("`ref'")-6)
 44.                 di "ref_name= `ref_name'"
 45.                 quiet putexcel `col_f'`row_i' = matrix(M_full)
 46.                 quiet putexcel `col_f'`row_0' = "`ref_name'"
 47.                 local col_aux = char(64 + `ref_col' + 1)
 48.                 quiet putexcel `col_aux'`row_0' = "% Change after `ref_name'"
 49.                 quiet putexcel (`col_f'`row_0':`col_aux'`row_0'), border(bottom,double)
 50.                 quiet putexcel (`col_f'`row_0':`col_aux'`row_0'), border(top,thin)
 51.                 quiet putexcel (`col_f'29:`col_aux'29), border(bottom,thin)
 52.         }
 53. }
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                Number of obs   =      1,165
Number of PSUs   = 1,165                Population size = 288,696.54
                                        Design df       =      1,164

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
revenue_p2022_base |   4.93e+09   1.88e+08      4.56e+09    5.29e+09
--------------------------------------------------------------------
revenue_p2022_base_1 =  4.925e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                  Number of obs   =        531
Number of PSUs   = 531                  Population size = 126,790.22
                                        Design df       =        530

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
revenue_p2022_base |   1.06e+09   7.34e+07      9.14e+08    1.20e+09
--------------------------------------------------------------------
revenue_p2022_base_2 =  1.059e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                  Number of obs   =        410
Number of PSUs   = 410                  Population size = 155,556.17
                                        Design df       =        409

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
revenue_p2022_base |   1.10e+09   8.68e+07      9.33e+08    1.27e+09
--------------------------------------------------------------------
revenue_p2022_base_3 =  1.104e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                  Number of obs   =        274
Number of PSUs   = 274                  Population size = 78,033.593
                                        Design df       =        273

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
revenue_p2022_base |   5.03e+08   3.86e+07      4.27e+08    5.79e+08
--------------------------------------------------------------------
revenue_p2022_base_4 =  5.031e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |      Total   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
revenue_p2022_base |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
--------------------------------------------------------------------
revenue_p2022_base =  7.591e+09
revenue_p2022_base
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      1,165
Number of PSUs   = 1,165               Population size = 288,696.54
                                       Design df       =      1,164

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
expend_p2022_base |   1.15e+09   6.20e+07      1.03e+09    1.27e+09
-------------------------------------------------------------------
expend_p2022_base_1 =  1.153e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        531
Number of PSUs   = 531                 Population size = 126,790.22
                                       Design df       =        530

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
expend_p2022_base |   3.18e+08   3.08e+07      2.57e+08    3.78e+08
-------------------------------------------------------------------
expend_p2022_base_2 =  3.178e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        410
Number of PSUs   = 410                 Population size = 155,556.17
                                       Design df       =        409

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
expend_p2022_base |   4.09e+08   3.03e+07      3.49e+08    4.68e+08
-------------------------------------------------------------------
expend_p2022_base_3 =  4.086e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        274
Number of PSUs   = 274                 Population size = 78,033.593
                                       Design df       =        273

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
expend_p2022_base |   3.45e+08   3.88e+07      2.69e+08    4.22e+08
-------------------------------------------------------------------
expend_p2022_base_4 =  3.454e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
expend_p2022_base |   2.23e+09   8.55e+07      2.06e+09    2.39e+09
-------------------------------------------------------------------
expend_p2022_base =  2.225e+09
expend_p2022_base
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                   Number of obs   =      1,165
Number of PSUs   = 1,165                   Population size = 288,696.54
                                           Design df       =      1,164

-----------------------------------------------------------------------
                      |             Linearized
                      |      Total   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
net_expend_p2022_base |   3.77e+09   1.77e+08      3.43e+09    4.12e+09
-----------------------------------------------------------------------
net_expend_p2022_base_1 =  3.772e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                     Number of obs   =        531
Number of PSUs   = 531                     Population size = 126,790.22
                                           Design df       =        530

-----------------------------------------------------------------------
                      |             Linearized
                      |      Total   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
net_expend_p2022_base |   7.41e+08   7.01e+07      6.03e+08    8.79e+08
-----------------------------------------------------------------------
net_expend_p2022_base_2 =  7.409e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                     Number of obs   =        410
Number of PSUs   = 410                     Population size = 155,556.17
                                           Design df       =        409

-----------------------------------------------------------------------
                      |             Linearized
                      |      Total   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
net_expend_p2022_base |   6.95e+08   8.73e+07      5.24e+08    8.67e+08
-----------------------------------------------------------------------
net_expend_p2022_base_3 =  6.952e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                     Number of obs   =        274
Number of PSUs   = 274                     Population size = 78,033.593
                                           Design df       =        273

-----------------------------------------------------------------------
                      |             Linearized
                      |      Total   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
net_expend_p2022_base |   1.58e+08   4.94e+07      6.04e+07    2.55e+08
-----------------------------------------------------------------------
net_expend_p2022_base_4 =  1.577e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                   Number of obs   =      2,380
Number of PSUs   = 2,380                   Population size = 649,076.53
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |      Total   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
net_expend_p2022_base |   5.37e+09   2.20e+08      4.93e+09    5.80e+09
-----------------------------------------------------------------------
net_expend_p2022_base =  5.366e+09
net_expend_p2022_base
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      1,165
Number of PSUs   = 1,165              Population size = 288,696.54
                                      Design df       =      1,164

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_ba |   4.94e+09   1.88e+08      4.57e+09    5.31e+09
------------------------------------------------------------------
revenue_p2022_ba_1 =  4.939e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        531
Number of PSUs   = 531                Population size = 126,790.22
                                      Design df       =        530

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_ba |   1.06e+09   7.32e+07      9.20e+08    1.21e+09
------------------------------------------------------------------
revenue_p2022_ba_2 =  1.064e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        410
Number of PSUs   = 410                Population size = 155,556.17
                                      Design df       =        409

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_ba |   1.11e+09   8.69e+07      9.39e+08    1.28e+09
------------------------------------------------------------------
revenue_p2022_ba_3 =  1.110e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        274
Number of PSUs   = 274                Population size = 78,033.593
                                      Design df       =        273

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_ba |   5.04e+08   3.87e+07      4.28e+08    5.80e+08
------------------------------------------------------------------
revenue_p2022_ba_4 =  5.041e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_ba |   7.62e+09   2.29e+08      7.17e+09    8.07e+09
------------------------------------------------------------------
revenue_p2022_ba =  7.617e+09
revenue_p2022_ba
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      1,165
Number of PSUs   = 1,165             Population size = 288,696.54
                                     Design df       =      1,164

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_ba |   1.15e+09   6.20e+07      1.03e+09    1.28e+09
-----------------------------------------------------------------
expend_p2022_ba_1 =  1.155e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1               Number of obs   =        531
Number of PSUs   = 531               Population size = 126,790.22
                                     Design df       =        530

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_ba |   3.18e+08   3.08e+07      2.57e+08    3.79e+08
-----------------------------------------------------------------
expend_p2022_ba_2 =  3.180e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1               Number of obs   =        410
Number of PSUs   = 410               Population size = 155,556.17
                                     Design df       =        409

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_ba |   4.10e+08   3.04e+07      3.50e+08    4.70e+08
-----------------------------------------------------------------
expend_p2022_ba_3 =  4.100e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1               Number of obs   =        274
Number of PSUs   = 274               Population size = 78,033.593
                                     Design df       =        273

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_ba |   3.46e+08   3.88e+07      2.70e+08    4.22e+08
-----------------------------------------------------------------
expend_p2022_ba_4 =  3.460e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_ba |   2.23e+09   8.55e+07      2.06e+09    2.40e+09
-----------------------------------------------------------------
expend_p2022_ba =  2.229e+09
expend_p2022_ba
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      1,165
Number of PSUs   = 1,165                 Population size = 288,696.54
                                         Design df       =      1,164

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_ba |   3.78e+09   1.77e+08      3.44e+09    4.13e+09
---------------------------------------------------------------------
net_expend_p2022_ba_1 =  3.785e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                   Number of obs   =        531
Number of PSUs   = 531                   Population size = 126,790.22
                                         Design df       =        530

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_ba |   7.46e+08   6.99e+07      6.09e+08    8.83e+08
---------------------------------------------------------------------
net_expend_p2022_ba_2 =  7.459e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                   Number of obs   =        410
Number of PSUs   = 410                   Population size = 155,556.17
                                         Design df       =        409

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_ba |   7.00e+08   8.74e+07      5.28e+08    8.72e+08
---------------------------------------------------------------------
net_expend_p2022_ba_3 =  6.997e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                   Number of obs   =        274
Number of PSUs   = 274                   Population size = 78,033.593
                                         Design df       =        273

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_ba |   1.58e+08   4.92e+07      6.13e+07    2.55e+08
---------------------------------------------------------------------
net_expend_p2022_ba_4 =  1.581e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_ba |   5.39e+09   2.20e+08      4.96e+09    5.82e+09
---------------------------------------------------------------------
net_expend_p2022_ba =  5.389e+09
net_expend_p2022_ba
ref_name= Reform ba
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      1,165
Number of PSUs   = 1,165               Population size = 288,696.54
                                       Design df       =      1,164

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_bsa |   4.92e+09   1.88e+08      4.56e+09    5.29e+09
-------------------------------------------------------------------
revenue_p2022_bsa_1 =  4.925e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        531
Number of PSUs   = 531                 Population size = 126,790.22
                                       Design df       =        530

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_bsa |   1.06e+09   7.34e+07      9.14e+08    1.20e+09
-------------------------------------------------------------------
revenue_p2022_bsa_2 =  1.059e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        410
Number of PSUs   = 410                 Population size = 155,556.17
                                       Design df       =        409

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_bsa |   1.10e+09   8.68e+07      9.33e+08    1.27e+09
-------------------------------------------------------------------
revenue_p2022_bsa_3 =  1.103e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        274
Number of PSUs   = 274                 Population size = 78,033.593
                                       Design df       =        273

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_bsa |   5.02e+08   3.86e+07      4.26e+08    5.78e+08
-------------------------------------------------------------------
revenue_p2022_bsa_4 =  5.022e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_bsa |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
-------------------------------------------------------------------
revenue_p2022_bsa =  7.589e+09
revenue_p2022_bsa
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      1,165
Number of PSUs   = 1,165              Population size = 288,696.54
                                      Design df       =      1,164

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_bsa |   1.16e+09   6.23e+07      1.04e+09    1.28e+09
------------------------------------------------------------------
expend_p2022_bsa_1 =  1.161e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        531
Number of PSUs   = 531                Population size = 126,790.22
                                      Design df       =        530

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_bsa |   3.18e+08   3.08e+07      2.58e+08    3.79e+08
------------------------------------------------------------------
expend_p2022_bsa_2 =  3.183e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        410
Number of PSUs   = 410                Population size = 155,556.17
                                      Design df       =        409

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_bsa |   4.10e+08   3.04e+07      3.51e+08    4.70e+08
------------------------------------------------------------------
expend_p2022_bsa_3 =  4.104e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        274
Number of PSUs   = 274                Population size = 78,033.593
                                      Design df       =        273

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_bsa |   3.55e+08   4.01e+07      2.76e+08    4.34e+08
------------------------------------------------------------------
expend_p2022_bsa_4 =  3.554e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_bsa |   2.25e+09   8.63e+07      2.08e+09    2.41e+09
------------------------------------------------------------------
expend_p2022_bsa =  2.245e+09
expend_p2022_bsa
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      1,165
Number of PSUs   = 1,165                  Population size = 288,696.54
                                          Design df       =      1,164

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_bsa |   3.76e+09   1.77e+08      3.42e+09    4.11e+09
----------------------------------------------------------------------
net_expend_p2022_bsa_1 =  3.764e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                    Number of obs   =        531
Number of PSUs   = 531                    Population size = 126,790.22
                                          Design df       =        530

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_bsa |   7.40e+08   7.01e+07      6.03e+08    8.78e+08
----------------------------------------------------------------------
net_expend_p2022_bsa_2 =  7.403e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                    Number of obs   =        410
Number of PSUs   = 410                    Population size = 155,556.17
                                          Design df       =        409

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_bsa |   6.93e+08   8.74e+07      5.21e+08    8.65e+08
----------------------------------------------------------------------
net_expend_p2022_bsa_3 =  6.928e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                    Number of obs   =        274
Number of PSUs   = 274                    Population size = 78,033.593
                                          Design df       =        273

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_bsa |   1.47e+08   5.04e+07      4.76e+07    2.46e+08
----------------------------------------------------------------------
net_expend_p2022_bsa_4 =  1.467e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      2,380
Number of PSUs   = 2,380                  Population size = 649,076.53
                                          Design df       =      2,379

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_bsa |   5.34e+09   2.21e+08      4.91e+09    5.78e+09
----------------------------------------------------------------------
net_expend_p2022_bsa =  5.344e+09
net_expend_p2022_bsa
ref_name= Reform bsa
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      1,165
Number of PSUs   = 1,165               Population size = 288,696.54
                                       Design df       =      1,164

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_tin |   4.71e+09   1.79e+08      4.36e+09    5.06e+09
-------------------------------------------------------------------
revenue_p2022_tin_1 =  4.712e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        531
Number of PSUs   = 531                 Population size = 126,790.22
                                       Design df       =        530

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_tin |   1.02e+09   6.98e+07      8.79e+08    1.15e+09
-------------------------------------------------------------------
revenue_p2022_tin_2 =  1.016e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        410
Number of PSUs   = 410                 Population size = 155,556.17
                                       Design df       =        409

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_tin |   1.05e+09   8.24e+07      8.91e+08    1.22e+09
-------------------------------------------------------------------
revenue_p2022_tin_3 =  1.053e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                 Number of obs   =        274
Number of PSUs   = 274                 Population size = 78,033.593
                                       Design df       =        273

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_tin |   4.83e+08   3.69e+07      4.10e+08    5.55e+08
-------------------------------------------------------------------
revenue_p2022_tin_4 =  4.829e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |      Total   std. err.     [95% conf. interval]
------------------+------------------------------------------------
revenue_p2022_tin |   7.26e+09   2.18e+08      6.84e+09    7.69e+09
-------------------------------------------------------------------
revenue_p2022_tin =  7.264e+09
revenue_p2022_tin
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      1,165
Number of PSUs   = 1,165              Population size = 288,696.54
                                      Design df       =      1,164

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_tin |   1.15e+09   6.19e+07      1.03e+09    1.27e+09
------------------------------------------------------------------
expend_p2022_tin_1 =  1.151e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        531
Number of PSUs   = 531                Population size = 126,790.22
                                      Design df       =        530

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_tin |   3.18e+08   3.08e+07      2.57e+08    3.78e+08
------------------------------------------------------------------
expend_p2022_tin_2 =  3.177e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        410
Number of PSUs   = 410                Population size = 155,556.17
                                      Design df       =        409

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_tin |   4.08e+08   3.03e+07      3.49e+08    4.68e+08
------------------------------------------------------------------
expend_p2022_tin_3 =  4.083e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        274
Number of PSUs   = 274                Population size = 78,033.593
                                      Design df       =        273

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_tin |   3.45e+08   3.88e+07      2.68e+08    4.21e+08
------------------------------------------------------------------
expend_p2022_tin_4 =  3.447e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
expend_p2022_tin |   2.22e+09   8.53e+07      2.05e+09    2.39e+09
------------------------------------------------------------------
expend_p2022_tin =  2.221e+09
expend_p2022_tin
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      1,165
Number of PSUs   = 1,165                  Population size = 288,696.54
                                          Design df       =      1,164

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_tin |   3.56e+09   1.68e+08      3.23e+09    3.89e+09
----------------------------------------------------------------------
net_expend_p2022_tin_1 =  3.561e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                    Number of obs   =        531
Number of PSUs   = 531                    Population size = 126,790.22
                                          Design df       =        530

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_tin |   6.98e+08   6.68e+07      5.67e+08    8.29e+08
----------------------------------------------------------------------
net_expend_p2022_tin_2 =  6.981e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                    Number of obs   =        410
Number of PSUs   = 410                    Population size = 155,556.17
                                          Design df       =        409

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_tin |   6.45e+08   8.31e+07      4.82e+08    8.08e+08
----------------------------------------------------------------------
net_expend_p2022_tin_3 =  6.450e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                    Number of obs   =        274
Number of PSUs   = 274                    Population size = 78,033.593
                                          Design df       =        273

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_tin |   1.38e+08   4.81e+07      4.34e+07    2.33e+08
----------------------------------------------------------------------
net_expend_p2022_tin_4 =  1.381e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                  Number of obs   =      2,380
Number of PSUs   = 2,380                  Population size = 649,076.53
                                          Design df       =      2,379

----------------------------------------------------------------------
                     |             Linearized
                     |      Total   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
net_expend_p2022_tin |   5.04e+09   2.10e+08      4.63e+09    5.45e+09
----------------------------------------------------------------------
net_expend_p2022_tin =  5.042e+09
net_expend_p2022_tin
ref_name= Reform tin
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      1,165
Number of PSUs   = 1,165              Population size = 288,696.54
                                      Design df       =      1,164

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_cb |   4.92e+09   1.88e+08      4.56e+09    5.29e+09
------------------------------------------------------------------
revenue_p2022_cb_1 =  4.925e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        531
Number of PSUs   = 531                Population size = 126,790.22
                                      Design df       =        530

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_cb |   1.06e+09   7.34e+07      9.14e+08    1.20e+09
------------------------------------------------------------------
revenue_p2022_cb_2 =  1.059e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        410
Number of PSUs   = 410                Population size = 155,556.17
                                      Design df       =        409

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_cb |   1.10e+09   8.68e+07      9.33e+08    1.27e+09
------------------------------------------------------------------
revenue_p2022_cb_3 =  1.104e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                Number of obs   =        274
Number of PSUs   = 274                Population size = 78,033.593
                                      Design df       =        273

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_cb |   5.03e+08   3.86e+07      4.27e+08    5.79e+08
------------------------------------------------------------------
revenue_p2022_cb_4 =  5.029e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |      Total   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
revenue_p2022_cb |   7.59e+09   2.29e+08      7.14e+09    8.04e+09
------------------------------------------------------------------
revenue_p2022_cb =  7.590e+09
revenue_p2022_cb
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      1,165
Number of PSUs   = 1,165             Population size = 288,696.54
                                     Design df       =      1,164

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_cb |   1.18e+09   6.29e+07      1.06e+09    1.31e+09
-----------------------------------------------------------------
expend_p2022_cb_1 =  1.184e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1               Number of obs   =        531
Number of PSUs   = 531               Population size = 126,790.22
                                     Design df       =        530

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_cb |   3.18e+08   3.09e+07      2.58e+08    3.79e+08
-----------------------------------------------------------------
expend_p2022_cb_2 =  3.183e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1               Number of obs   =        410
Number of PSUs   = 410               Population size = 155,556.17
                                     Design df       =        409

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_cb |   4.10e+08   3.04e+07      3.50e+08    4.69e+08
-----------------------------------------------------------------
expend_p2022_cb_3 =  4.096e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1               Number of obs   =        274
Number of PSUs   = 274               Population size = 78,033.593
                                     Design df       =        273

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_cb |   3.59e+08   4.03e+07      2.80e+08    4.39e+08
-----------------------------------------------------------------
expend_p2022_cb_4 =  3.593e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |      Total   std. err.     [95% conf. interval]
----------------+------------------------------------------------
expend_p2022_cb |   2.27e+09   8.69e+07      2.10e+09    2.44e+09
-----------------------------------------------------------------
expend_p2022_cb =  2.271e+09
expend_p2022_cb
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      1,165
Number of PSUs   = 1,165                 Population size = 288,696.54
                                         Design df       =      1,164

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_cb |   3.74e+09   1.76e+08      3.39e+09    4.09e+09
---------------------------------------------------------------------
net_expend_p2022_cb_1 =  3.741e+09
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                   Number of obs   =        531
Number of PSUs   = 531                   Population size = 126,790.22
                                         Design df       =        530

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_cb |   7.40e+08   7.01e+07      6.03e+08    8.78e+08
---------------------------------------------------------------------
net_expend_p2022_cb_2 =  7.404e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                   Number of obs   =        410
Number of PSUs   = 410                   Population size = 155,556.17
                                         Design df       =        409

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_cb |   6.94e+08   8.72e+07      5.23e+08    8.66e+08
---------------------------------------------------------------------
net_expend_p2022_cb_3 =  6.941e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =   1                   Number of obs   =        274
Number of PSUs   = 274                   Population size = 78,033.593
                                         Design df       =        273

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_cb |   1.44e+08   5.02e+07      4.49e+07    2.42e+08
---------------------------------------------------------------------
net_expend_p2022_cb_4 =  1.437e+08
(running total on estimation sample)

Survey: Total estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |      Total   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
net_expend_p2022_cb |   5.32e+09   2.20e+08      4.89e+09    5.75e+09
---------------------------------------------------------------------
net_expend_p2022_cb =  5.319e+09
net_expend_p2022_cb
ref_name= Reform cb

. 
. *- Table 2: Welfare and Efficiency Indicators   
. //Social Welfare        
. //Gini index    
. //Marginal Cost of Public Funds  - MCPF
. //Winners       
. 
. *- Calculations and Results Table 2
. putexcel set "`filename'", modify sheet("Indicators")

. local ref_col=`col_i'

. foreach ref in $reform_pred{ 
  2.         mat M_`ref'=J(4,1,.)
  3.         gen eq_dispy_`ref' = dispy_`ref'/oecd_equiv_scale  //obtain equivalised dpi by merg
> ed scale 
  4.         
.         sum eq_dispy_`ref' [aw = dwt]
  5.         scalar eq_dispy_m_`ref' = r(mean)
  6.         
.         ainequal eq_dispy_`ref'  [aw = dwt] if new_sel==1 , all
  7.         scalar gini_`ref' = real(r(gini_1))  //Gini index
  8.         scalar soc_`ref' = eq_dispy_m_`ref'*(1-gini_`ref') //Social Welfare
  9.         *replace eq_dispy_base = eq_dispy_p${ryear}_base 
.         gen double Win_dispy_`ref' = (eq_dispy_`ref' > eq_dispy_p${ryear}_base + 1) //Winners
 10.         svy:mean Win_dispy_`ref'  if new_sel==1 
 11.         matselrc r(table) aux,row(1)
 12.         
.         mat M_`ref'[1,1] = soc_`ref'
 13.         mat M_`ref'[2,1] = gini_`ref'
 14.         mat M_`ref'[4,1] = aux[1,1]
 15.         
.         if regexm("`ref'","base"){
 16.                 local col_f=char(64 + `col_i')
 17.                 mat M_base=M_`ref'
 18.                 
.                 *- Write Abs. value and % Change
.                 putexcel `col_f'`row_i' = matrix(M_`ref')
 19.                 putexcel `col_f'`row_0' = "Baseline"
 20.         }
 21.         else {
 22.                 scalar MCPF = 1 - (`net_expend_`ref''  -  `net_expend_`baseline_name'')/(`n
> et_expend_nb_`ref''  -  `net_expend_`baseline_name'')
 23.                 scalar list MCPF
 24.                 mat M_`ref'[3,1] = MCPF
 25. 
.                 local ++ref_col
 26.                 local col_f=char(64 + `ref_col')
 27. 
.                 *- Write values
.                 local ref_name="Reform " + substr("`ref'",7,strlen("`ref'")-6)
 28.                 quiet putexcel `col_f'`row_i' = matrix(M_`ref')
 29.                 quiet putexcel `col_f'`row_0' = "`ref_name'"
 30.                 quiet putexcel (`col_f'`row_0':`col_f'`row_0'), border(bottom,double)
 31.                 quiet putexcel (`col_f'`row_0':`col_f'`row_0'), border(top,thin)
 32.                 quiet putexcel (`col_f'10:`col_f'10), border(bottom,thin)
 33.         }
 34. }
(1,165 missing values generated)

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
eq_dispy_p~e |   2,380  649076.526    1007.105   603.4994   -107.928   5107.986

--------------------------------------------------------------
                     Inequality measures | eq_dispy_p2022_base
-----------------------------------------+--------------------
                 Relative mean deviation |             0.21678
                Coefficient of variation |             0.59924
              Standard deviation of logs |             0.58182
                        Gini coefficient |             0.30351
                          Mehran measure |             0.41524
                          Piesch measure |             0.24765
                         Kakwani measure |             0.08297
              Theil index (GE(a), a = 1) |             0.15504
       Mean Log Deviation (GE(a), a = 0) |             0.15629
           Entropy index (GE(a), a = -1) |             0.20647
Half (Coeff.Var. squared) (GE(a), a = 2) |             0.17947
  Atkinson inequality measures (eps = 1) |             0.14446
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                  Number of obs   =      2,380
Number of PSUs   = 2,380                  Population size = 649,076.53
                                          Design df       =      2,379

----------------------------------------------------------------------
                     |             Linearized
                     |       Mean   std. err.     [95% conf. interval]
---------------------+------------------------------------------------
Win_dispy_p2022_base |          0  (omitted)
----------------------------------------------------------------------
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
(1,165 missing values generated)

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
eq_dispy_p~a |   2,380  649076.526    1001.422    606.932  -122.2779   5155.946

------------------------------------------------------------
                     Inequality measures | eq_dispy_p2022_ba
-----------------------------------------+------------------
                 Relative mean deviation |           0.21993
                Coefficient of variation |           0.60607
              Standard deviation of logs |           0.58447
                        Gini coefficient |           0.30743
                          Mehran measure |           0.42043
                          Piesch measure |           0.25092
                         Kakwani measure |           0.08472
              Theil index (GE(a), a = 1) |           0.15804
       Mean Log Deviation (GE(a), a = 0) |           0.15923
           Entropy index (GE(a), a = -1) |           0.28604
Half (Coeff.Var. squared) (GE(a), a = 2) |           0.18358
  Atkinson inequality measures (eps = 1) |           0.14703
------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
Win_dispy_p2022_ba |   .2719209   .0129696       .246488    .2973539
--------------------------------------------------------------------
      MCPF =  .43981804
(1,165 missing values generated)

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
eq_dispy_~sa |   2,380  649076.526    1008.065   602.9068   -107.928   5107.986

-------------------------------------------------------------
                     Inequality measures | eq_dispy_p2022_bsa
-----------------------------------------+-------------------
                 Relative mean deviation |            0.21627
                Coefficient of variation |            0.59808
              Standard deviation of logs |            0.58007
                        Gini coefficient |            0.30280
                          Mehran measure |            0.41417
                          Piesch measure |            0.24711
                         Kakwani measure |            0.08260
              Theil index (GE(a), a = 1) |            0.15437
       Mean Log Deviation (GE(a), a = 0) |            0.15544
           Entropy index (GE(a), a = -1) |            0.20513
Half (Coeff.Var. squared) (GE(a), a = 2) |            0.17878
  Atkinson inequality measures (eps = 1) |            0.14374
-------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |       Mean   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
Win_dispy_p2022_bsa |   .0670042   .0077754       .051757    .0822515
---------------------------------------------------------------------
      MCPF = -.19674993
(1,165 missing values generated)

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
eq_dispy_p~n |   2,380  649076.526    1030.601   621.4643  -104.9114   5268.242

-------------------------------------------------------------
                     Inequality measures | eq_dispy_p2022_tin
-----------------------------------------+-------------------
                 Relative mean deviation |            0.21872
                Coefficient of variation |            0.60301
              Standard deviation of logs |            0.58744
                        Gini coefficient |            0.30596
                          Mehran measure |            0.41872
                          Piesch measure |            0.24959
                         Kakwani measure |            0.08420
              Theil index (GE(a), a = 1) |            0.15726
       Mean Log Deviation (GE(a), a = 0) |            0.15903
           Entropy index (GE(a), a = -1) |            0.21106
Half (Coeff.Var. squared) (GE(a), a = 2) |            0.18173
  Atkinson inequality measures (eps = 1) |            0.14680
-------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                 Number of obs   =      2,380
Number of PSUs   = 2,380                 Population size = 649,076.53
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |       Mean   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
Win_dispy_p2022_tin |    .940404   .0079677      .9247796    .9560283
---------------------------------------------------------------------
      MCPF = -.00025912
(1,165 missing values generated)

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
eq_dispy_p~b |   2,380  649076.526    1009.548   602.8734   -107.928   5107.986

------------------------------------------------------------
                     Inequality measures | eq_dispy_p2022_cb
-----------------------------------------+------------------
                 Relative mean deviation |           0.21594
                Coefficient of variation |           0.59717
              Standard deviation of logs |           0.57981
                        Gini coefficient |           0.30240
                          Mehran measure |           0.41371
                          Piesch measure |           0.24674
                         Kakwani measure |           0.08241
              Theil index (GE(a), a = 1) |           0.15399
       Mean Log Deviation (GE(a), a = 0) |           0.15515
           Entropy index (GE(a), a = -1) |           0.20502
Half (Coeff.Var. squared) (GE(a), a = 2) |           0.17823
  Atkinson inequality measures (eps = 1) |           0.14349
------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
Win_dispy_p2022_cb |    .347995   .0137401      .3210512    .3749388
--------------------------------------------------------------------
      MCPF =   -.020969

. 
. 
. *- Calculations and results for Tables 3, 3.1, 3.2 and 4
. 
. //Table 3 : Labour supply changes at intensive and extensive margin
. //Table 3.1 : Labour supply changes at intensive and extensive margin, employees
. //Table 3.2 : Labour supply changes at intensive and extensive margin, selfemployed
. //Table 4 : Labour supply changes at intensive and extensive margin, by decile
. 
. gen hh_f = 0

. replace hh_f = 1 if hhtype ==11 & flex_f ==1 
(532 real changes made)

. replace hh_f = 2 if hhtype ==12 & flex_f ==1 
(633 real changes made)

. replace hh_f = 3 if hhtype ==21 & flex_f ==1 
(255 real changes made)

. replace hh_f = 4 if hhtype ==22 & flex_f ==1 
(531 real changes made)

. 
. gen hh_m = 0

. replace hh_m = 1 if hhtype ==11 & flex_m ==1 
(532 real changes made)

. replace hh_m = 2 if hhtype ==12 & flex_m ==1
(633 real changes made)

. replace hh_m = 3 if hhtype ==31 & flex_m ==1
(19 real changes made)

. replace hh_m = 4 if hhtype ==32 & flex_m ==1
(410 real changes made)

. 
. local sex "m f"

. sumdist eq_dispy_p${ryear}_base [aw= dwt], ng(5) qgp(pct)
 
Warning: eq_dispy_p2022_base has 4 values < 0. Used in calculations
 
Distributional summary statistics, 5 quantile groups

---------------------------------------------------------------------------
Quantile  |
group     |    Quantile  % of median     Share, %      L(p), %        GL(p)
----------+----------------------------------------------------------------
        1 |     550.222       63.273        8.191        8.191       82.495
        2 |     750.354       86.287       12.954       21.145      212.952
        3 |     994.992      114.419       17.198       38.343      386.151
        4 |    1382.380      158.966       23.173       61.516      619.532
        5 |                                38.484      100.000     1007.105
---------------------------------------------------------------------------
Share = quantile group share of total eq_dispy_p2022_base; 
L(p)=cumulative group share; GL(p)=L(p)*mean(eq_dispy_p2022_base)

. 
. 
. if $EmplStatus == 1{
.         local work_status "all employee byquintile"
.         local sheet_name1="Labour supply"
.         local sheet_name2="Labour supply - employee"
.         local sheet_name3="Labour supply - income quintile"
. }

. if $EmplStatus == 2{
.         local work_status "all employee selfemployed  byquintile"
.         local sheet_name1="Labour supply"
.         local sheet_name2="Labour supply - employee"
.         local sheet_name3="Labour supply - selfemployed"
.         local sheet_name4="Labour supply - income quintile"
. }

. local sheetnum=1

. 
. 
. foreach status in `work_status'{
  2. *set trace on
.         di in r "*********`status'*************************"
  3. 
.         putexcel set "`filename'", modify sheet("`sheet_name`sheetnum''")
  4.         local ++sheetnum
  5.         local ref_col=1
  6.         
.         local counter_ref=1
  7.         foreach ref in $reform_pred{ 
  8.                 
.                 
.                 if "`status'" == "byquintile"{
  9.                         local var_inc = "h inwork" 
 10.                 }
 11.                 else{
 12.                         local var_inc = "h inwork unemp inactiv" 
 13.                 }
 14.                 
.                 local first_inc=1
 15.                 foreach var in `var_inc'{
 16.                         local counter=1
 17.                         
.                         di in r "`var'"
 18.                         foreach s in `sex'{ 
 19.                                 
.                                 di in r "`counter_ref'"
 20.                                 if `counter_ref'==1 & "`status'" != "byquintile"{
 21.                                         capture confirm variable insobs_`s',exact
 22.                                         if !_rc {
 23.                                                 di in r "inobs exists"
 24.                                                         quiet replace `var'_`ref' = 0 if in
> sobs_`s' != .
 25.                                                         
.                                    }
 26.                                         else{
 27.                                                 forvalues i =1/4 {
 28.                                                         sum hh_`s' if hh_`s'==`i' & `status
> '==1
 29.                                                         if r(N) == 0 {
 30.                                                                 quiet insobs 1, after(_N) 
 31.                                                                 quiet gen insobs_`s' = `i' 
> if idhh == .
 32.                                                                 quiet replace hh_`s' = inso
> bs_`s' if insobs_`s' != . 
 33.                                                                 
.                                                                 quiet replace `status' = 1 if 
> insobs_`s' != . 
 34.                                                                 replace strata1 = 1 if inso
> bs_`s' != .
 35.                                                                 replace psu1 = 1 if insobs_
> `s' != .
 36.                                                                 replace dwt = 1 if insobs_`
> s' != .
 37.                                                                 quiet replace `var'_`ref' =
>  0 if insobs_`s' != .
 38.                                                 
.                                                         }
 39.                                                 }
 40.                                         }
 41.                                 }
 42.                                 if `counter_ref'!=1 & "`status'" != "byquintile"{
 43.                                         capture confirm variable insobs_`s',exact
 44.                                         if !_rc {
 45.                                                 di in r "inobs exists"
 46.                                                         quiet replace `var'_`ref' = 0 if in
> sobs_`s' != .
 47.                                                         
.                                         }
 48.                                         else {
 49.                                                 display "insobs does not exist"
 50.                                         }
 51. 
.                                 }
 52.                         
.                                 if "`status'"=="all"{
 53.                                         svy: mean `var'_`ref',over(hh_`s') subpop(if hh_`s'
> >0)
 54.                                 } 
 55.                                 else if "`status'"=="byquintile"{
 56.                                         svy:mean `var'_`ref' if flex_`s' ==1 , over(pct)
 57.                                 }
 58.                                 else{
 59.                                         svy:mean `var'_`ref',over(hh_`s') subpop(if hh_`s'>
> 0 & `status'==1)
 60.                                         
.                                 }
 61.                                 matrix `var'_`ref'_hh = e(b)
 62.                                 matrix `var'_`ref'_hh = `var'_`ref'_hh'
 63.                         
.                                 if `counter'==1{                                    
 64.                                         mat M_`var'_`ref'= `var'_`ref'_hh
 65.                                                                                 
.                                         if "`status'"=="all"{
 66.                                             
.                                             * Total by gender 1
.                                                 svy:mean `var'_`ref' if flex_`s' ==1
 67.                                                 scalar `var'_`ref' = _b[`var'_`ref']
 68.                                                 mat M_`var'_`ref'=(M_`var'_`ref' \ `var'_`r
> ef')
 69.                                         }
 70.                                 }
 71.                                 else{
 72.                                         
.                                         if "`status'"=="all"{
 73.                                             mat M_`var'_`ref'=(M_`var'_`ref' \ `var'_`ref'_
> hh)
 74.                                                 
.                                                 * Total by gender 2
.                                                 svy:mean `var'_`ref' if flex_`s' ==1
 75.                                                 scalar `var'_`ref' = _b[`var'_`ref']
 76.                                                 mat M_`var'_`ref'=(M_`var'_`ref' \ `var'_`r
> ef')
 77.                                                 
.                                                 * Total all (whole population)
.                                                 svy:mean `var'_`ref'
 78.                                                 scalar `var'_`ref' = _b[`var'_`ref']
 79.                                                 mat M_`var'_`ref'=(M_`var'_`ref' \ `var'_`r
> ef')
 80.                                         }
 81.                                         else{
 82.                                                 mat M_`var'_`ref'=(M_`var'_`ref' \ J(1,1,.)
>  \ `var'_`ref'_hh)
 83.                                         }
 84.                                 }
 85.                                 local ++counter
 86.                                 
.                                 if "`status'"=="all"{
 87.                                         svy:mean `var'_`ref' if new_sel==1
 88.                                 }
 89.                                 else if "`status'"=="byquintile"{
 90.                                         svy:mean `var'_`ref' if flex_`s' ==1 
 91.                                         scalar `var'_`ref' = _b[`var'_`ref']
 92.                                 }
 93.                                 else{
 94.                                         svy:mean `var'_`ref' if new_sel==1 & `status' ==1
 95.                                 }
 96.                                 matrix `var'_`ref' = _b[`var'_`ref']
 97.                         }
 98.                         
.                         *- Build matrix
.                         local aux_row=rowsof(`var'_`ref'_hh)
 99.                         if `first_inc'==1{
100.                                 mat M_`ref' = M_`var'_`ref'
101.                                 if "`status'"=="all"{
102.                                         matrix Matrix_lines=(`row_i' + `aux_row', `row_i' +
>  2* `aux_row' + 1, `row_i' + 2* `aux_row' + 2)
103.                                 }
104.                         }
105.                         else{
106.                             if "`status'"=="all"{
107.                                     local row_aux=Matrix_lines[1,(`first_inc'-1)*3]+2
108.                                         matrix Matrix_lines=(Matrix_lines, `row_aux' + `aux
> _row', `row_aux' + 2* `aux_row' + 1, `row_aux' + 2* `aux_row' + 2)
109.                                     mat M_`ref' = (M_`ref' \ J(1,1,.) \ M_`var'_`ref')
110.                                 }
111.                                 else{
112.                                     mat M_`ref' = (M_`ref' \ J(2,1,.) \ M_`var'_`ref')
113.                                 }
114.                         }
115.                         local ++first_inc
116.                 }
117. 
.                 //mat list M_`ref'
.                 
.                 *- Write matrix in excel sheet 
.                 
.                 local value_m=rowsof(M_`ref') //Number of rows to create difference matrix 
118.                 
.                 //Row number to draw bottom line in table
.                 if "`status'"=="byquintile" | "`status'"=="all"{
119.                         local value_n=`value_m' + 5     
120.                 }
121.                 else{
122.                     local value_n=`value_m' + 6 
123.                 }
124.                 
.                 if regexm("`ref'","base") {
125.                         local baseline_name="`ref'"
126.                         local col_f=char(64 + `col_i' + 1)
127.                         mat M_base=M_`ref'
128.                         
.                         *- Write Abs. value and % Change
.                         putexcel `col_f'`row_i' = matrix(M_`ref')
129.                         putexcel `col_f'`row_0' = "Baseline"
130.                 }
131.                 else{
132.                         local ref_col=`ref_col' + 3
133.                         local col_f=char(64 + `ref_col' + 1)
134.                         mat M_diff=(M_`ref' - M_base)   //Absolute difference
135.                         mat M_diff_percent=J(`value_m',1,.)
136.                         mat M_missing=J(`value_m',1,0)
137.                         
.                         forvalues i = 1/`value_m' {
138.                                 mat M_diff_percent[`i',1] = M_diff[`i',1]/M_base[`i',1] //%
>  Difference
139.                                 if M_base[`i',1]==0{
140.                                         mat M_missing[`i',1] = 1
141.                                 }
142.                         }
143.                         mat M_full=(M_`ref',M_diff_percent)
144. 
.                         *- Write Abs. value and % Change
.                         quiet putexcel `col_f'`row_i' = matrix(M_full)
145.                         
.                         *- Format table
.                         local ref_name="Reform " + substr("`ref'",7,strlen("`ref'")-6)
146.                         quiet putexcel `col_f'`row_0' = "`ref_name'"
147.                         local col_aux=char(64 + `ref_col' + 2)
148.                         quiet putexcel `col_aux'`row_0' = "% Change after `ref_name'"
149.                         quiet putexcel (`col_f'`row_0':`col_aux'`row_0'), border(bottom,dou
> ble)
150.                         quiet putexcel (`col_f'`row_0':`col_aux'`row_0'), border(top,thin)
151.                         quiet putexcel (`col_f'`value_n':`col_aux'`value_n'), border(bottom
> ,thin)
152.                         
.                         if "`status'"=="all"{
153.                             local aux_row=colsof(Matrix_lines)
154.                                 forvalues i = 1/`aux_row'{
155.                                     local row_aux=Matrix_lines[1,`i']
156.                                     quiet putexcel (`col_f'`row_aux':`col_aux'`row_aux'), b
> order(bottom,thin)
157.                                 }
158.                         }
159.                         
.                         *- Set missing values to n/a
.                         forvalues i = 1/`value_m' {
160.                                 if M_missing[`i',1] == 1{
161.                                         local row_f = `row_i' + (`i'-1)
162.                                         quiet putexcel `col_aux'`row_f' = "n/a"
163.                                 }
164.                         }
165.                 }
166.                 local ++counter_ref
167.         }
168. }
*********all*************************
h
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         19           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        410           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                 Number of obs   =      3,545
Number of PSUs   = 2,380                 Population size = 937,773.07
                                         Subpop. no. obs =      1,594
                                         Subpop. size    = 454,446.51
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |       Mean   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
c.h_p2022_base@hh_m |
                 1  |   39.75902   .2571744      39.25471    40.26333
                 2  |   39.61268    .242894      39.13638    40.08899
                 3  |   40.90187   1.924662      37.12769    44.67606
                 4  |   34.85326   .5081372      33.85682     35.8497
---------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   38.06599   .2251242      37.62442    38.50756
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   37.84516   .1867613      37.47893    38.21139
--------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        255           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        531           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                 Number of obs   =      3,545
Number of PSUs   = 2,380                 Population size = 937,773.07
                                         Subpop. no. obs =      1,951
                                         Subpop. size    = 483,326.56
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |       Mean   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
c.h_p2022_base@hh_f |
                 1  |   36.13887   .4309975       35.2937    36.98404
                 2  |   38.42121   .2846717      37.86298    38.97944
                 3  |   35.92815   .6414765      34.67024    37.18606
                 4  |   38.07935   .3734403      37.34705    38.81166
---------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   37.19665   .2162338      36.77258    37.62073
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      3,545
Number of PSUs   = 2,380          Population size = 937,773.07
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   37.61793   .1648745      37.29462    37.94125
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   37.84516   .1867613      37.47893    38.21139
--------------------------------------------------------------
inwork
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         19           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        410           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,594
                                              Subpop. size    = 454,446.51
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inwork_p2022_base@hh_m |
                      1  |   .9652546   .0035261      .9583401    .9721691
                      2  |   .9619004   .0035349      .9549687    .9688322
                      3  |   .9363673   .0224818      .8922813    .9804533
                      4  |   .8624559   .0113018      .8402935    .8846184
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,594
Number of PSUs   = 1,594               Population size = 454,446.51
                                       Design df       =      1,593

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9285149   .0044753      .9197369     .937293
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9282886   .0037828      .9208707    .9357066
-------------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        255           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        531           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,951
                                              Subpop. size    = 483,326.56
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inwork_p2022_base@hh_f |
                      1  |   .9037267   .0092561      .8855758    .9218776
                      2  |   .9475106   .0037382        .94018    .9548411
                      3  |   .9015947   .0146175      .8729303    .9302591
                      4  |   .9417602   .0074477      .9271556    .9563648
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,951
Number of PSUs   = 1,951               Population size = 483,326.56
                                       Design df       =      1,950

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9244989   .0044243       .915822    .9331759
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9264451   .0033369      .9199015    .9329887
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9282886   .0037828      .9208707    .9357066
-------------------------------------------------------------------
unemp
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         19           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        410           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,594
                                             Subpop. size    = 454,446.51
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.unemp_p2022_base@hh_m |
                     1  |          0  (omitted)
                     2  |          0  (omitted)
                     3  |          0  (omitted)
                     4  |          0  (omitted)
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
unemp_p2022_base |          0  (omitted)
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
unemp_p2022_base |          0  (omitted)
------------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        255           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        531           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,951
                                             Subpop. size    = 483,326.56
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.unemp_p2022_base@hh_f |
                     1  |          0  (omitted)
                     2  |          0  (omitted)
                     3  |          0  (omitted)
                     4  |          0  (omitted)
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,951
Number of PSUs   = 1,951              Population size = 483,326.56
                                      Design df       =      1,950

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
unemp_p2022_base |          0  (omitted)
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      3,545
Number of PSUs   = 2,380              Population size = 937,773.07
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
unemp_p2022_base |          0  (omitted)
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
unemp_p2022_base |          0  (omitted)
------------------------------------------------------------------
inactiv
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         19           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        410           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                       Number of obs   =      3,545
Number of PSUs   = 2,380                       Population size = 937,773.07
                                               Subpop. no. obs =      1,594
                                               Subpop. size    = 454,446.51
                                               Design df       =      2,379

---------------------------------------------------------------------------
                          |             Linearized
                          |       Mean   std. err.     [95% conf. interval]
--------------------------+------------------------------------------------
c.inactiv_p2022_base@hh_m |
                       1  |   .0347454   .0035261      .0278309    .0416599
                       2  |   .0380996   .0035349      .0311678    .0450313
                       3  |   .0636327   .0224818      .0195467    .1077187
                       4  |   .1375441   .0113018      .1153816    .1597065
---------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      1,594
Number of PSUs   = 1,594                Population size = 454,446.51
                                        Design df       =      1,593

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
inactiv_p2022_base |   .0714851   .0044753       .062707    .0802631
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
inactiv_p2022_base |   .0717114   .0037828      .0642934    .0791293
--------------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        532           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        633           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        255           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        531           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                       Number of obs   =      3,545
Number of PSUs   = 2,380                       Population size = 937,773.07
                                               Subpop. no. obs =      1,951
                                               Subpop. size    = 483,326.56
                                               Design df       =      2,379

---------------------------------------------------------------------------
                          |             Linearized
                          |       Mean   std. err.     [95% conf. interval]
--------------------------+------------------------------------------------
c.inactiv_p2022_base@hh_f |
                       1  |   .0962733   .0092561      .0781224    .1144242
                       2  |   .0524894   .0037382      .0451589      .05982
                       3  |   .0984053   .0146175      .0697409    .1270697
                       4  |   .0582398   .0074477      .0436352    .0728444
---------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      1,951
Number of PSUs   = 1,951                Population size = 483,326.56
                                        Design df       =      1,950

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
inactiv_p2022_base |   .0755011   .0044243      .0668241     .084178
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
inactiv_p2022_base |   .0735549   .0033369      .0670113    .0800985
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      2,380
Number of PSUs   = 2,380                Population size = 649,076.53
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
inactiv_p2022_base |   .0717114   .0037828      .0642934    .0791293
--------------------------------------------------------------------
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
h
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,594
                                       Subpop. size    = 454,446.51
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_ba@hh_m |
               1  |   39.72201   .2547415      39.22247    40.22155
               2  |    39.5094   .2441814      39.03057    39.98823
               3  |   40.95098    2.01164      37.00623    44.89573
               4  |   34.47632   .5138742      33.46863    35.48401
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   37.89669   .2282697      37.44895    38.34443
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   37.67534   .1878155      37.30704    38.04364
--------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,951
                                       Subpop. size    = 483,326.56
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_ba@hh_f |
               1  |   36.14669   .4227149      35.31776    36.97561
               2  |   38.25062   .2863537      37.68909    38.81215
               3  |   35.81932   .6265544      34.59067    37.04797
               4  |   37.87504   .3711324      37.14726    38.60281
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   37.08724   .2127597      36.66998     37.5045
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      3,545
Number of PSUs   = 2,380          Population size = 937,773.07
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |    37.4795   .1643697      37.15718    37.80182
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   37.67534   .1878155      37.30704    38.04364
--------------------------------------------------------------
inwork
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,594
                                            Subpop. size    = 454,446.51
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_ba@hh_m |
                    1  |   .9649994   .0034171      .9582986    .9717003
                    2  |   .9604009   .0035134      .9535113    .9672905
                    3  |   .9370278    .021422      .8950201    .9790355
                    4  |   .8565166   .0112193       .834516    .8785173
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,594
Number of PSUs   = 1,594             Population size = 454,446.51
                                     Design df       =      1,593

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |   .9259993   .0044569      .9172572    .9347414
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |   .9262644   .0037463      .9189181    .9336108
-----------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,951
                                            Subpop. size    = 483,326.56
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_ba@hh_f |
                    1  |   .9052242    .009005      .8875657    .9228828
                    2  |   .9455806   .0038204       .938089    .9530722
                    3  |   .9021223   .0142855       .874109    .9301356
                    4  |   .9401323   .0073026      .9258122    .9544523
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,951
Number of PSUs   = 1,951             Population size = 483,326.56
                                     Design df       =      1,950

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |    .924172     .00432      .9156997    .9326442
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      3,545
Number of PSUs   = 2,380             Population size = 937,773.07
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |   .9250575    .003282      .9186217    .9314933
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |   .9262644   .0037463      .9189181    .9336108
-----------------------------------------------------------------
unemp
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,594
                                           Subpop. size    = 454,446.51
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_ba@hh_m |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      1,594
Number of PSUs   = 1,594            Population size = 454,446.51
                                    Design df       =      1,593

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_ba |          0  (omitted)
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,380
Number of PSUs   = 2,380            Population size = 649,076.53
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_ba |          0  (omitted)
----------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,951
                                           Subpop. size    = 483,326.56
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_ba@hh_f |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      1,951
Number of PSUs   = 1,951            Population size = 483,326.56
                                    Design df       =      1,950

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_ba |          0  (omitted)
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      3,545
Number of PSUs   = 2,380            Population size = 937,773.07
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_ba |          0  (omitted)
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,380
Number of PSUs   = 2,380            Population size = 649,076.53
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_ba |          0  (omitted)
----------------------------------------------------------------
inactiv
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,594
                                             Subpop. size    = 454,446.51
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_ba@hh_m |
                     1  |   .0350006   .0034171      .0282997    .0417014
                     2  |   .0395991   .0035134      .0327095    .0464887
                     3  |   .0629722    .021422      .0209645    .1049799
                     4  |   .1434834   .0112193      .1214827     .165484
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_ba |   .0740007   .0044569      .0652586    .0827428
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_ba |   .0737356   .0037463      .0663892    .0810819
------------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,951
                                             Subpop. size    = 483,326.56
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_ba@hh_f |
                     1  |   .0947758    .009005      .0771172    .1124343
                     2  |   .0544194   .0038204      .0469278     .061911
                     3  |   .0978777   .0142855      .0698644     .125891
                     4  |   .0598677   .0073026      .0455477    .0741878
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,951
Number of PSUs   = 1,951              Population size = 483,326.56
                                      Design df       =      1,950

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_ba |    .075828     .00432      .0673558    .0843003
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      3,545
Number of PSUs   = 2,380              Population size = 937,773.07
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_ba |   .0749425    .003282      .0685067    .0813783
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_ba |   .0737356   .0037463      .0663892    .0810819
------------------------------------------------------------------
h
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,594
                                        Subpop. size    = 454,446.51
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_bsa@hh_m |
                1  |     39.742   .2576294       39.2368    40.24721
                2  |   39.60892   .2433645       39.1317    40.08615
                3  |   40.61474   1.901279      36.88641    44.34308
                4  |   34.79999   .5126778      33.79465    35.80533
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   38.03407   .2261682      37.59046    38.47769
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   37.80663   .1879356      37.43809    38.17516
--------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,951
                                        Subpop. size    = 483,326.56
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_bsa@hh_f |
                1  |   36.12495   .4286824      35.28432    36.96558
                2  |   38.41697   .2844279      37.85922    38.97472
                3  |   35.80032    .653189      34.51944     37.0812
                4  |    38.0649   .3739019      37.33169    38.79811
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   37.16905   .2164376      36.74458    37.59353
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      3,545
Number of PSUs   = 2,380          Population size = 937,773.07
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   37.58824   .1655607      37.26359     37.9129
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   37.80663   .1879356      37.43809    38.17516
--------------------------------------------------------------
inwork
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,594
                                             Subpop. size    = 454,446.51
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_bsa@hh_m |
                     1  |   .9648911   .0035372      .9579547    .9718274
                     2  |   .9618063   .0035501      .9548447    .9687678
                     3  |    .930634   .0258616      .8799205    .9813476
                     4  |   .8611385   .0114184      .8387474    .8835295
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |    .927777    .004523      .9189053    .9366488
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |   .9273716   .0038265       .919868    .9348752
------------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,951
                                             Subpop. size    = 483,326.56
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_bsa@hh_f |
                     1  |   .9033722   .0092375      .8852578    .9214866
                     2  |   .9474319   .0037475      .9400831    .9547806
                     3  |   .8984254   .0149473      .8691143    .9277364
                     4  |   .9414063   .0074605      .9267766     .956036
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,951
Number of PSUs   = 1,951              Population size = 483,326.56
                                      Design df       =      1,950

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |   .9238194   .0044431      .9151057    .9325331
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      3,545
Number of PSUs   = 2,380              Population size = 937,773.07
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |   .9257373    .003368      .9191327    .9323418
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |   .9273716   .0038265       .919868    .9348752
------------------------------------------------------------------
unemp
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,594
                                            Subpop. size    = 454,446.51
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_bsa@hh_m |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,594
Number of PSUs   = 1,594             Population size = 454,446.51
                                     Design df       =      1,593

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_bsa |          0  (omitted)
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_bsa |          0  (omitted)
-----------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,951
                                            Subpop. size    = 483,326.56
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_bsa@hh_f |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,951
Number of PSUs   = 1,951             Population size = 483,326.56
                                     Design df       =      1,950

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_bsa |          0  (omitted)
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      3,545
Number of PSUs   = 2,380             Population size = 937,773.07
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_bsa |          0  (omitted)
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_bsa |          0  (omitted)
-----------------------------------------------------------------
inactiv
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,594
                                              Subpop. size    = 454,446.51
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_bsa@hh_m |
                      1  |   .0351089   .0035372      .0281726    .0420453
                      2  |   .0381937   .0035501      .0312322    .0451553
                      3  |    .069366   .0258616      .0186524    .1200795
                      4  |   .1388615   .0114184      .1164705    .1612526
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,594
Number of PSUs   = 1,594               Population size = 454,446.51
                                       Design df       =      1,593

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_bsa |    .072223    .004523      .0633512    .0810947
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_bsa |   .0726284   .0038265      .0651248     .080132
-------------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,951
                                              Subpop. size    = 483,326.56
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_bsa@hh_f |
                      1  |   .0966278   .0092375      .0785134    .1147422
                      2  |   .0525681   .0037475      .0452194    .0599169
                      3  |   .1015746   .0149473      .0722636    .1308857
                      4  |   .0585937   .0074605       .043964    .0732234
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,951
Number of PSUs   = 1,951               Population size = 483,326.56
                                       Design df       =      1,950

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_bsa |   .0761806   .0044431      .0674669    .0848943
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_bsa |   .0742627    .003368      .0676582    .0808673
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_bsa |   .0726284   .0038265      .0651248     .080132
-------------------------------------------------------------------
h
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,594
                                        Subpop. size    = 454,446.51
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_tin@hh_m |
                1  |   39.78965   .2608814      39.27807    40.30123
                2  |   39.68495   .2423117      39.20979    40.16012
                3  |   41.23989   2.037726      37.24399    45.23579
                4  |   34.89387   .5119262         33.89    35.89774
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   38.11815   .2271248      37.67265    38.56364
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   37.90992   .1884536      37.54037    38.27947
--------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,951
                                        Subpop. size    = 483,326.56
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_tin@hh_f |
                1  |   36.16301   .4343476      35.31128    37.01475
                2  |   38.47776   .2844464      37.91997    39.03554
                3  |   36.04426   .6443087      34.78079    37.30772
                4  |   38.16181   .3790436      37.41852     38.9051
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   37.25721   .2178801      36.82991    37.68451
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      3,545
Number of PSUs   = 2,380          Population size = 937,773.07
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   37.67442   .1664743      37.34797    38.00087
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   37.90992   .1884536      37.54037    38.27947
--------------------------------------------------------------
inwork
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,594
                                             Subpop. size    = 454,446.51
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_tin@hh_m |
                     1  |   .9656709   .0036466      .9585201    .9728217
                     2  |   .9631461   .0034922      .9562981    .9699941
                     3  |   .9418791   .0201043      .9024553     .981303
                     4  |   .8632568   .0113452      .8410094    .8855042
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9294007   .0044855      .9206025    .9381988
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9292479   .0037966       .921803    .9366929
------------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,951
                                             Subpop. size    = 483,326.56
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_tin@hh_f |
                     1  |   .9037787     .00934      .8854634     .922094
                     2  |   .9482029   .0037114       .940925    .9554808
                     3  |   .9031732   .0146472      .8744507    .9318958
                     4  |    .942652   .0075395      .9278672    .9574367
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,951
Number of PSUs   = 1,951              Population size = 483,326.56
                                      Design df       =      1,950

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9251478   .0044572      .9164064    .9338891
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      3,545
Number of PSUs   = 2,380              Population size = 937,773.07
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9272087   .0033609      .9206181    .9337993
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9292479   .0037966       .921803    .9366929
------------------------------------------------------------------
unemp
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,594
                                            Subpop. size    = 454,446.51
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_tin@hh_m |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,594
Number of PSUs   = 1,594             Population size = 454,446.51
                                     Design df       =      1,593

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_tin |          0  (omitted)
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_tin |          0  (omitted)
-----------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,951
                                            Subpop. size    = 483,326.56
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_tin@hh_f |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,951
Number of PSUs   = 1,951             Population size = 483,326.56
                                     Design df       =      1,950

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_tin |          0  (omitted)
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      3,545
Number of PSUs   = 2,380             Population size = 937,773.07
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_tin |          0  (omitted)
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_tin |          0  (omitted)
-----------------------------------------------------------------
inactiv
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,594
                                              Subpop. size    = 454,446.51
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_tin@hh_m |
                      1  |   .0343291   .0036466      .0271783    .0414799
                      2  |   .0368539   .0034922      .0300059    .0437019
                      3  |   .0581209   .0201043       .018697    .0975447
                      4  |   .1367432   .0113452      .1144958    .1589906
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,594
Number of PSUs   = 1,594               Population size = 454,446.51
                                       Design df       =      1,593

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_tin |   .0705993   .0044855      .0618012    .0793975
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_tin |   .0707521   .0037966      .0633071     .078197
-------------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,951
                                              Subpop. size    = 483,326.56
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_tin@hh_f |
                      1  |   .0962213     .00934       .077906    .1145366
                      2  |   .0517971   .0037114      .0445192     .059075
                      3  |   .0968268   .0146472      .0681042    .1255493
                      4  |    .057348   .0075395      .0425633    .0721328
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,951
Number of PSUs   = 1,951               Population size = 483,326.56
                                       Design df       =      1,950

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_tin |   .0748522   .0044572      .0661109    .0835936
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_tin |   .0727913   .0033609      .0662007    .0793819
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,380
Number of PSUs   = 2,380               Population size = 649,076.53
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_tin |   .0707521   .0037966      .0633071     .078197
-------------------------------------------------------------------
h
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,594
                                       Subpop. size    = 454,446.51
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_cb@hh_m |
               1  |      39.76   .2568835      39.25626    40.26374
               2  |   39.61243   .2428937      39.13612    40.08873
               3  |   40.93339   1.923371      37.16173    44.70504
               4  |   34.85092   .5081839      33.85439    35.84745
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   38.06619   .2251371      37.62459    38.50778
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   37.84061    .186921      37.47407    38.20716
--------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,951
                                       Subpop. size    = 483,326.56
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_cb@hh_f |
               1  |    36.1253   .4307185      35.28068    36.96992
               2  |   38.42032   .2846986      37.86204     38.9786
               3  |    35.8859   .6446945      34.62168    37.15012
               4  |   38.07799   .3734828      37.34561    38.81038
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   37.18547   .2164176      36.76104    37.60991
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      3,545
Number of PSUs   = 2,380          Population size = 937,773.07
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   37.61227   .1649059      37.28889    37.93564
--------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,380
Number of PSUs   = 2,380          Population size = 649,076.53
                                  Design df       =      2,379

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   37.84061    .186921      37.47407    38.20716
--------------------------------------------------------------
inwork
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,594
                                            Subpop. size    = 454,446.51
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_cb@hh_m |
                    1  |   .9652848   .0035153      .9583914    .9721782
                    2  |   .9618947    .003535      .9549628    .9688267
                    3  |   .9369952   .0222243      .8934142    .9805763
                    4  |   .8623977   .0113032      .8402326    .8845628
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,594
Number of PSUs   = 1,594             Population size = 454,446.51
                                     Design df       =      1,593

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9285186   .0044744      .9197422     .937295
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9281893   .0037865      .9207641    .9356146
-----------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,951
                                            Subpop. size    = 483,326.56
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_cb@hh_f |
                    1  |   .9034459   .0092489      .8853092    .9215826
                    2  |    .947491   .0037389      .9401591    .9548229
                    3  |   .9006721   .0147083      .8718297    .9295145
                    4  |   .9417324    .007449      .9271253    .9563396
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,951
Number of PSUs   = 1,951             Population size = 483,326.56
                                     Design df       =      1,950

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9242606   .0044294      .9155737    .9329475
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      3,545
Number of PSUs   = 2,380             Population size = 937,773.07
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |    .926324   .0033374      .9197796    .9328685
-----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,380
Number of PSUs   = 2,380             Population size = 649,076.53
                                     Design df       =      2,379

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9281893   .0037865      .9207641    .9356146
-----------------------------------------------------------------
unemp
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,594
                                           Subpop. size    = 454,446.51
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_cb@hh_m |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      1,594
Number of PSUs   = 1,594            Population size = 454,446.51
                                    Design df       =      1,593

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_cb |          0  (omitted)
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,380
Number of PSUs   = 2,380            Population size = 649,076.53
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_cb |          0  (omitted)
----------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,951
                                           Subpop. size    = 483,326.56
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_cb@hh_f |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      1,951
Number of PSUs   = 1,951            Population size = 483,326.56
                                    Design df       =      1,950

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_cb |          0  (omitted)
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      3,545
Number of PSUs   = 2,380            Population size = 937,773.07
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_cb |          0  (omitted)
----------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,380
Number of PSUs   = 2,380            Population size = 649,076.53
                                    Design df       =      2,379

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_cb |          0  (omitted)
----------------------------------------------------------------
inactiv
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,594
                                             Subpop. size    = 454,446.51
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_cb@hh_m |
                     1  |   .0347152   .0035153      .0278218    .0416086
                     2  |   .0381053    .003535      .0311733    .0450372
                     3  |   .0630048   .0222243      .0194237    .1065858
                     4  |   .1376023   .0113032      .1154372    .1597674
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_cb |   .0714814   .0044744       .062705    .0802578
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_cb |   .0718107   .0037865      .0643854    .0792359
------------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,951
                                             Subpop. size    = 483,326.56
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_cb@hh_f |
                     1  |   .0965541   .0092489      .0784174    .1146908
                     2  |    .052509   .0037389      .0451771    .0598409
                     3  |   .0993279   .0147083      .0704855    .1281703
                     4  |   .0582676    .007449      .0436604    .0728747
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,951
Number of PSUs   = 1,951              Population size = 483,326.56
                                      Design df       =      1,950

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_cb |   .0757394   .0044294      .0670525    .0844263
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      3,545
Number of PSUs   = 2,380              Population size = 937,773.07
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_cb |    .073676   .0033374      .0671315    .0802204
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,380
Number of PSUs   = 2,380              Population size = 649,076.53
                                      Design df       =      2,379

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_cb |   .0718107   .0037865      .0643854    .0792359
------------------------------------------------------------------
*********employee*************************
h
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        499           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        573           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         16           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        300           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                 Number of obs   =      3,545
Number of PSUs   = 2,380                 Population size = 937,773.07
                                         Subpop. no. obs =      1,388
                                         Subpop. size    = 390,799.71
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |       Mean   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
c.h_p2022_base@hh_m |
                 1  |   39.84055   .2572665      39.33606    40.34504
                 2  |   40.04285   .2459596      39.56053    40.52516
                 3  |   41.14568   2.226214      36.78016     45.5112
                 4  |   36.43012   .5646362      35.32289    37.53735
---------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   38.70038   .1822696      38.34293    39.05783
--------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        468           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        568           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        213           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        475           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                 Number of obs   =      3,545
Number of PSUs   = 2,380                 Population size = 937,773.07
                                         Subpop. no. obs =      1,724
                                         Subpop. size    = 426,650.45
                                         Design df       =      2,379

---------------------------------------------------------------------
                    |             Linearized
                    |       Mean   std. err.     [95% conf. interval]
--------------------+------------------------------------------------
c.h_p2022_base@hh_f |
                 1  |   37.12195    .396492      36.34445    37.89946
                 2  |   38.80176   .2872792      38.23841     39.3651
                 3  |   37.41356   .6192021      36.19933    38.62779
                 4  |    38.6021    .380583      37.85579    39.34841
---------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   38.70038   .1822696      38.34293    39.05783
--------------------------------------------------------------
inwork
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        499           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        573           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         16           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        300           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,388
                                              Subpop. size    = 390,799.71
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inwork_p2022_base@hh_m |
                      1  |   .9690618   .0035468      .9621067     .976017
                      2  |   .9704801   .0031148      .9643722    .9765881
                      3  |   .9685945   .0127176      .9436557    .9935332
                      4  |   .9012414   .0126389       .876457    .9260259
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,076
Number of PSUs   = 2,076               Population size = 562,473.71
                                       Design df       =      2,075

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9493923     .00357      .9423913    .9563934
-------------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        468           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        568           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        213           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        475           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,724
                                              Subpop. size    = 426,650.45
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inwork_p2022_base@hh_f |
                      1  |   .9284305   .0077637      .9132062    .9436549
                      2  |    .958091     .00329      .9516394    .9645427
                      3  |   .9362305   .0135824      .9095959     .962865
                      4  |   .9558003   .0072931      .9414988    .9701018
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,076
Number of PSUs   = 2,076               Population size = 562,473.71
                                       Design df       =      2,075

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9493923     .00357      .9423913    .9563934
-------------------------------------------------------------------
unemp
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        499           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        573           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         16           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        300           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,388
                                             Subpop. size    = 390,799.71
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.unemp_p2022_base@hh_m |
                     1  |          0  (omitted)
                     2  |          0  (omitted)
                     3  |          0  (omitted)
                     4  |          0  (omitted)
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
unemp_p2022_base |          0  (omitted)
------------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        468           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        568           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        213           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        475           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,724
                                             Subpop. size    = 426,650.45
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.unemp_p2022_base@hh_f |
                     1  |          0  (omitted)
                     2  |          0  (omitted)
                     3  |          0  (omitted)
                     4  |          0  (omitted)
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
unemp_p2022_base |          0  (omitted)
------------------------------------------------------------------
inactiv
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        499           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        573           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |         16           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_m |        300           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                       Number of obs   =      3,545
Number of PSUs   = 2,380                       Population size = 937,773.07
                                               Subpop. no. obs =      1,388
                                               Subpop. size    = 390,799.71
                                               Design df       =      2,379

---------------------------------------------------------------------------
                          |             Linearized
                          |       Mean   std. err.     [95% conf. interval]
--------------------------+------------------------------------------------
c.inactiv_p2022_base@hh_m |
                       1  |   .0309382   .0035468       .023983    .0378933
                       2  |   .0295199   .0031148      .0234119    .0356278
                       3  |   .0314055   .0127176      .0064668    .0563443
                       4  |   .0987586   .0126389      .0739741     .123543
---------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      2,076
Number of PSUs   = 2,076                Population size = 562,473.71
                                        Design df       =      2,075

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
inactiv_p2022_base |   .0506077     .00357      .0436066    .0576087
--------------------------------------------------------------------
1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        468           1           0          1          1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        568           2           0          2          2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        213           3           0          3          3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        hh_f |        475           4           0          4          4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                       Number of obs   =      3,545
Number of PSUs   = 2,380                       Population size = 937,773.07
                                               Subpop. no. obs =      1,724
                                               Subpop. size    = 426,650.45
                                               Design df       =      2,379

---------------------------------------------------------------------------
                          |             Linearized
                          |       Mean   std. err.     [95% conf. interval]
--------------------------+------------------------------------------------
c.inactiv_p2022_base@hh_f |
                       1  |   .0715695   .0077637      .0563451    .0867938
                       2  |    .041909     .00329      .0354573    .0483606
                       3  |   .0637695   .0135824       .037135    .0904041
                       4  |   .0441997   .0072931      .0298982    .0585012
---------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      2,076
Number of PSUs   = 2,076                Population size = 562,473.71
                                        Design df       =      2,075

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
inactiv_p2022_base |   .0506077     .00357      .0436066    .0576087
--------------------------------------------------------------------
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
h
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,388
                                       Subpop. size    = 390,799.71
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_ba@hh_m |
               1  |   39.82814   .2533977      39.33124    40.32504
               2  |   39.99792   .2422427      39.52289    40.47295
               3  |   41.15398   2.259523      36.72314    45.58482
               4  |   36.42954   .5374517      35.37561    37.48346
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   38.65759   .1765913      38.31127     39.0039
--------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,724
                                       Subpop. size    = 426,650.45
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_ba@hh_f |
               1  |    37.1368     .39045      36.37114    37.90246
               2  |   38.68869   .2862223      38.12742    39.24996
               3  |   37.35224   .5947683      36.18592    38.51856
               4  |   38.48284   .3756151      37.74628    39.21941
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   38.65759   .1765913      38.31127     39.0039
--------------------------------------------------------------
inwork
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,388
                                            Subpop. size    = 390,799.71
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_ba@hh_m |
                    1  |   .9692269   .0033852      .9625887    .9758651
                    2  |   .9700651   .0028959      .9643864    .9757438
                    3  |   .9686375   .0127936      .9435497    .9937254
                    4  |   .9027456   .0116517      .8798971    .9255941
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |   .9496967    .003345      .9431367    .9562567
-----------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,724
                                            Subpop. size    = 426,650.45
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_ba@hh_f |
                    1  |   .9295542    .007573      .9147038    .9444045
                    2  |    .957059   .0032319      .9507214    .9633966
                    3  |   .9375626   .0129455      .9121769    .9629482
                    4  |   .9552842    .007039      .9414809    .9690875
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |   .9496967    .003345      .9431367    .9562567
-----------------------------------------------------------------
unemp
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,388
                                           Subpop. size    = 390,799.71
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_ba@hh_m |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,076
Number of PSUs   = 2,076            Population size = 562,473.71
                                    Design df       =      2,075

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_ba |          0  (omitted)
----------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,724
                                           Subpop. size    = 426,650.45
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_ba@hh_f |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,076
Number of PSUs   = 2,076            Population size = 562,473.71
                                    Design df       =      2,075

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_ba |          0  (omitted)
----------------------------------------------------------------
inactiv
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,388
                                             Subpop. size    = 390,799.71
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_ba@hh_m |
                     1  |   .0307731   .0033852      .0241349    .0374113
                     2  |   .0299349   .0028959      .0242562    .0356136
                     3  |   .0313625   .0127936      .0062746    .0564503
                     4  |   .0972544   .0116517      .0744059    .1201029
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_ba |   .0503033    .003345      .0437433    .0568633
------------------------------------------------------------------
2
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,724
                                             Subpop. size    = 426,650.45
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_ba@hh_f |
                     1  |   .0704458    .007573      .0555955    .0852962
                     2  |    .042941   .0032319      .0366034    .0492786
                     3  |   .0624374   .0129455      .0370518    .0878231
                     4  |   .0447158    .007039      .0309125    .0585191
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_ba |   .0503033    .003345      .0437433    .0568633
------------------------------------------------------------------
h
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,388
                                        Subpop. size    = 390,799.71
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_bsa@hh_m |
                1  |   39.82777   .2575575      39.32271    40.33283
                2  |   40.04249   .2459662      39.56016    40.52482
                3  |   41.15364   2.221998      36.79638    45.51089
                4  |   36.42683   .5647259      35.31943    37.53424
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   38.68536   .1827965      38.32687    39.04384
--------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,724
                                        Subpop. size    = 426,650.45
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_bsa@hh_f |
                1  |   37.12953   .3904714      36.36383    37.89522
                2  |   38.80151   .2872848      38.23815    39.36486
                3  |   37.31947    .630668      36.08275    38.55618
                4  |   38.59612    .380636      37.84971    39.34254
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   38.68536   .1827965      38.32687    39.04384
--------------------------------------------------------------
inwork
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,388
                                             Subpop. size    = 390,799.71
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_bsa@hh_m |
                     1  |   .9687921   .0035529       .961825    .9757591
                     2  |   .9704714   .0031151      .9643629    .9765799
                     3  |   .9687414     .01263      .9439745    .9935084
                     4  |   .9011843   .0126359      .8764057    .9259629
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |    .949045   .0035832       .942018     .956072
------------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,724
                                             Subpop. size    = 426,650.45
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_bsa@hh_f |
                     1  |   .9285147   .0076604       .913493    .9435365
                     2  |   .9580861   .0032902      .9516341    .9645382
                     3  |   .9339419   .0139006      .9066834    .9612005
                     4  |   .9556673   .0072955       .941361    .9699735
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |    .949045   .0035832       .942018     .956072
------------------------------------------------------------------
unemp
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,388
                                            Subpop. size    = 390,799.71
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_bsa@hh_m |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_bsa |          0  (omitted)
-----------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,724
                                            Subpop. size    = 426,650.45
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_bsa@hh_f |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_bsa |          0  (omitted)
-----------------------------------------------------------------
inactiv
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,388
                                              Subpop. size    = 390,799.71
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_bsa@hh_m |
                      1  |   .0312079   .0035529      .0242409     .038175
                      2  |   .0295286   .0031151      .0234201    .0356371
                      3  |   .0312586     .01263      .0064916    .0560255
                      4  |   .0988157   .0126359      .0740371    .1235943
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,076
Number of PSUs   = 2,076               Population size = 562,473.71
                                       Design df       =      2,075

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_bsa |    .050955   .0035832       .043928     .057982
-------------------------------------------------------------------
3
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,724
                                              Subpop. size    = 426,650.45
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_bsa@hh_f |
                      1  |   .0714853   .0076604      .0564635     .086507
                      2  |   .0419139   .0032902      .0354618    .0483659
                      3  |   .0660581   .0139006      .0387995    .0933166
                      4  |   .0443327   .0072955      .0300265     .058639
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,076
Number of PSUs   = 2,076               Population size = 562,473.71
                                       Design df       =      2,075

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_bsa |    .050955   .0035832       .043928     .057982
-------------------------------------------------------------------
h
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,388
                                        Subpop. size    = 390,799.71
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_tin@hh_m |
                1  |   39.86445     .26148      39.35169     40.3772
                2  |   40.10786   .2457365      39.62598    40.58974
                3  |   41.29575   2.312288      36.76144    45.83006
                4  |    36.3889   .5742853      35.26274    37.51505
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   38.73988   .1848859       38.3773    39.10246
--------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      3,545
Number of PSUs   = 2,380                Population size = 937,773.07
                                        Subpop. no. obs =      1,724
                                        Subpop. size    = 426,650.45
                                        Design df       =      2,379

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_tin@hh_f |
                1  |   37.13582   .4014743      36.34854    37.92309
                2  |   38.84851    .287196      38.28533    39.41169
                3  |   37.53293   .6223147       36.3126    38.75327
                4  |   38.67206   .3880226      37.91117    39.43296
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   38.73988   .1848859       38.3773    39.10246
--------------------------------------------------------------
inwork
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,388
                                             Subpop. size    = 390,799.71
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_tin@hh_m |
                     1  |   .9693356   .0036904      .9620988    .9765724
                     2  |   .9715477   .0030873      .9654935    .9776018
                     3  |    .970815   .0121467      .9469959    .9946341
                     4  |   .9002658    .012819      .8751282    .9254034
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9497793   .0036207      .9426787      .95688
------------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,724
                                             Subpop. size    = 426,650.45
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_tin@hh_f |
                     1  |   .9282268   .0079138      .9127081    .9437454
                     2  |   .9585595   .0032919      .9521041    .9650148
                     3  |   .9377139   .0136342      .9109777      .96445
                     4  |   .9563813   .0074439       .941784    .9709786
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9497793   .0036207      .9426787      .95688
------------------------------------------------------------------
unemp
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,388
                                            Subpop. size    = 390,799.71
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_tin@hh_m |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_tin |          0  (omitted)
-----------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,724
                                            Subpop. size    = 426,650.45
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.unemp_p2022_tin@hh_f |
                    1  |          0  (omitted)
                    2  |          0  (omitted)
                    3  |          0  (omitted)
                    4  |          0  (omitted)
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
unemp_p2022_tin |          0  (omitted)
-----------------------------------------------------------------
inactiv
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,388
                                              Subpop. size    = 390,799.71
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_tin@hh_m |
                      1  |   .0306644   .0036904      .0234276    .0379012
                      2  |   .0284523   .0030873      .0223982    .0345065
                      3  |    .029185   .0121467      .0053659    .0530041
                      4  |   .0997342    .012819      .0745966    .1248718
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,076
Number of PSUs   = 2,076               Population size = 562,473.71
                                       Design df       =      2,075

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_tin |   .0502207   .0036207        .04312    .0573213
-------------------------------------------------------------------
4
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                      Number of obs   =      3,545
Number of PSUs   = 2,380                      Population size = 937,773.07
                                              Subpop. no. obs =      1,724
                                              Subpop. size    = 426,650.45
                                              Design df       =      2,379

--------------------------------------------------------------------------
                         |             Linearized
                         |       Mean   std. err.     [95% conf. interval]
-------------------------+------------------------------------------------
c.inactiv_p2022_tin@hh_f |
                      1  |   .0717732   .0079138      .0562546    .0872919
                      2  |   .0414405   .0032919      .0349852    .0478959
                      3  |   .0622861   .0136342        .03555    .0890223
                      4  |   .0436187   .0074439      .0290214     .058216
--------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      2,076
Number of PSUs   = 2,076               Population size = 562,473.71
                                       Design df       =      2,075

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inactiv_p2022_tin |   .0502207   .0036207        .04312    .0573213
-------------------------------------------------------------------
h
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,388
                                       Subpop. size    = 390,799.71
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_cb@hh_m |
               1  |    39.8405   .2569902      39.33655    40.34445
               2  |   40.04262   .2459575       39.5603    40.52493
               3  |   41.15148   2.222044      36.79413    45.50882
               4  |   36.42649   .5647722      35.31899    37.53399
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   38.69652   .1823411      38.33893    39.05411
--------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      3,545
Number of PSUs   = 2,380               Population size = 937,773.07
                                       Subpop. no. obs =      1,724
                                       Subpop. size    = 426,650.45
                                       Design df       =      2,379

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_cb@hh_f |
               1  |    37.1075   .3963651      36.33024    37.88475
               2  |   38.80081   .2873114      38.23741    39.36422
               3  |   37.38458   .6209584       36.1669    38.60225
               4  |   38.60123   .3806227      37.85484    39.34761
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      2,076
Number of PSUs   = 2,076          Population size = 562,473.71
                                  Design df       =      2,075

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   38.69652   .1823411      38.33893    39.05411
--------------------------------------------------------------
inwork
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,388
                                            Subpop. size    = 390,799.71
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_cb@hh_m |
                    1  |   .9690702   .0035375      .9621333    .9760072
                    2  |   .9704751   .0031148       .964367    .9765832
                    3  |    .968751    .012606      .9440312    .9934708
                    4  |    .901151   .0126424      .8763598    .9259422
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9493141   .0035722      .9423085    .9563196
-----------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      3,545
Number of PSUs   = 2,380                    Population size = 937,773.07
                                            Subpop. no. obs =      1,724
                                            Subpop. size    = 426,650.45
                                            Design df       =      2,379

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_cb@hh_f |
                    1  |   .9281293   .0077594      .9129134    .9433451
                    2  |   .9580705   .0032911      .9516168    .9645241
                    3  |   .9356479    .013635      .9089102    .9623855
                    4  |   .9557816   .0072942      .9414779    .9700853
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      2,076
Number of PSUs   = 2,076             Population size = 562,473.71
                                     Design df       =      2,075

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9493141   .0035722      .9423085    .9563196
-----------------------------------------------------------------
unemp
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,388
                                           Subpop. size    = 390,799.71
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_cb@hh_m |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,076
Number of PSUs   = 2,076            Population size = 562,473.71
                                    Design df       =      2,075

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_cb |          0  (omitted)
----------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      3,545
Number of PSUs   = 2,380                   Population size = 937,773.07
                                           Subpop. no. obs =      1,724
                                           Subpop. size    = 426,650.45
                                           Design df       =      2,379

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.unemp_p2022_cb@hh_f |
                   1  |          0  (omitted)
                   2  |          0  (omitted)
                   3  |          0  (omitted)
                   4  |          0  (omitted)
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1            Number of obs   =      2,076
Number of PSUs   = 2,076            Population size = 562,473.71
                                    Design df       =      2,075

----------------------------------------------------------------
               |             Linearized
               |       Mean   std. err.     [95% conf. interval]
---------------+------------------------------------------------
unemp_p2022_cb |          0  (omitted)
----------------------------------------------------------------
inactiv
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,388
                                             Subpop. size    = 390,799.71
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_cb@hh_m |
                     1  |   .0309298   .0035375      .0239928    .0378667
                     2  |   .0295249   .0031148      .0234168     .035633
                     3  |    .031249    .012606      .0065292    .0559688
                     4  |    .098849   .0126424      .0740578    .1236402
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_cb |   .0506859   .0035722      .0436804    .0576915
------------------------------------------------------------------
5
insobs does not exist
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      3,545
Number of PSUs   = 2,380                     Population size = 937,773.07
                                             Subpop. no. obs =      1,724
                                             Subpop. size    = 426,650.45
                                             Design df       =      2,379

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inactiv_p2022_cb@hh_f |
                     1  |   .0718707   .0077594      .0566549    .0870866
                     2  |   .0419295   .0032911      .0354759    .0483832
                     3  |   .0643521    .013635      .0376145    .0910898
                     4  |   .0442184   .0072942      .0299147    .0585221
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      2,076
Number of PSUs   = 2,076              Population size = 562,473.71
                                      Design df       =      2,075

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inactiv_p2022_cb |   .0506859   .0035722      .0436804    .0576915
------------------------------------------------------------------
*********byquintile*************************
h
1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                Number of obs   =      1,594
Number of PSUs   = 1,594                Population size = 454,446.51
                                        Design df       =      1,593

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_base@pct |
                1  |   32.86342   .6547405      31.57918    34.14766
                2  |   37.95229   .4461163      37.07726    38.82733
                3  |    39.3144   .4569768      38.41806    40.21074
                4  |   39.97548   .2283684      39.52755    40.42341
                5  |   39.75723   .4647413      38.84566     40.6688
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   38.06599   .2251242      37.62442    38.50756
--------------------------------------------------------------
1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                  Number of obs   =        786
Number of PSUs   = 786                  Population size = 194,630.01
                                        Design df       =        785

--------------------------------------------------------------------
                   |             Linearized
                   |       Mean   std. err.     [95% conf. interval]
-------------------+------------------------------------------------
c.h_p2022_base@pct |
                1  |   33.18521   .9191484      31.38093    34.98949
                2  |   37.27357   .5272527      36.23857    38.30856
                3  |   38.59682   .4367647      37.73945    39.45418
                4  |   39.36788   .4057625      38.57138    40.16439
                5  |   39.29431   1.107148      37.12098    41.46763
--------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
h_p2022_base |   37.19665   .2162338      36.77258    37.62073
--------------------------------------------------------------
inwork
1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                     Number of obs   =      1,594
Number of PSUs   = 1,594                     Population size = 454,446.51
                                             Design df       =      1,593

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_base@pct |
                     1  |   .8106274   .0149077      .7813866    .8398682
                     2  |    .930789   .0066994      .9176485    .9439296
                     3  |   .9534682   .0071748      .9393952    .9675413
                     4  |   .9787879   .0028224      .9732519    .9843239
                     5  |   .9593801   .0087617      .9421945    .9765658
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,594
Number of PSUs   = 1,594               Population size = 454,446.51
                                       Design df       =      1,593

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9285149   .0044753      .9197369     .937293
-------------------------------------------------------------------
1
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                       Number of obs   =        786
Number of PSUs   = 786                       Population size = 194,630.01
                                             Design df       =        785

-------------------------------------------------------------------------
                        |             Linearized
                        |       Mean   std. err.     [95% conf. interval]
------------------------+------------------------------------------------
c.inwork_p2022_base@pct |
                     1  |   .8321806   .0212803      .7904075    .8739536
                     2  |   .9322716   .0109974      .9106838    .9538593
                     3  |   .9620256   .0081955      .9459379    .9781134
                     4  |   .9765508    .007647      .9615398    .9915619
                     5  |   .9556839   .0206735       .915102    .9962658
-------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,951
Number of PSUs   = 1,951               Population size = 483,326.56
                                       Design df       =      1,950

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
inwork_p2022_base |   .9244989   .0044243       .915822    .9331759
-------------------------------------------------------------------
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
file ../results//lt_2019_3ch/3-Behavioral_effect_new_reform.xlsx saved
h
2
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
c.h_p2022_ba@pct |
              1  |   32.48238   .6543264      31.19895    33.76581
              2  |   37.64301   .4547151       36.7511    38.53491
              3  |   39.14946   .4810525       38.2059    40.09303
              4  |   39.94896   .2293838      39.49904    40.39889
              5  |   39.74968    .465395      38.83683    40.66253
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   37.89669   .2282697      37.44895    38.34443
--------------------------------------------------------------
2
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                Number of obs   =        786
Number of PSUs   = 786                Population size = 194,630.01
                                      Design df       =        785

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
c.h_p2022_ba@pct |
              1  |   32.95821   .8791215      31.23251    34.68392
              2  |   36.86001   .5316734      35.81634    37.90368
              3  |   38.58377   .4188415      37.76159    39.40595
              4  |   39.31088   .4175376      38.49126     40.1305
              5  |   39.26207   1.114094      37.07512    41.44903
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_ba |   37.08724   .2127597      36.66998     37.5045
--------------------------------------------------------------
inwork
2
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      1,594
Number of PSUs   = 1,594                   Population size = 454,446.51
                                           Design df       =      1,593

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.inwork_p2022_ba@pct |
                   1  |   .8054743   .0142335       .777556    .8333925
                   2  |   .9260491   .0069816      .9123551    .9397431
                   3  |   .9507955   .0077541      .9355861    .9660049
                   4  |   .9783387   .0028503      .9727479    .9839295
                   5  |   .9591988   .0088334      .9418725    .9765252
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,594
Number of PSUs   = 1,594             Population size = 454,446.51
                                     Design df       =      1,593

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |   .9259993   .0044569      .9172572    .9347414
-----------------------------------------------------------------
2
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                     Number of obs   =        786
Number of PSUs   = 786                     Population size = 194,630.01
                                           Design df       =        785

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.inwork_p2022_ba@pct |
                   1  |   .8336993   .0206895       .793086    .8743126
                   2  |   .9276611   .0111929      .9056895    .9496328
                   3  |   .9625011   .0074763      .9478253    .9771769
                   4  |   .9756414   .0077645      .9603997    .9908832
                   5  |   .9557921   .0203133      .9159173    .9956668
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,951
Number of PSUs   = 1,951             Population size = 483,326.56
                                     Design df       =      1,950

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_ba |    .924172     .00432      .9156997    .9326442
-----------------------------------------------------------------
h
3
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,594
Number of PSUs   = 1,594               Population size = 454,446.51
                                       Design df       =      1,593

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_bsa@pct |
               1  |    32.7291   .6558484      31.44268    34.01551
               2  |   37.92423   .4483039       37.0449    38.80356
               3  |   39.31101   .4570905      38.41445    40.20758
               4  |   39.97368   .2285587      39.52538    40.42199
               5  |   39.75697   .4647363      38.84542    40.66853
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   38.03407   .2261682      37.59046    38.47769
--------------------------------------------------------------
3
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                 Number of obs   =        786
Number of PSUs   = 786                 Population size = 194,630.01
                                       Design df       =        785

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_bsa@pct |
               1  |   33.05253   .9265888      31.23365    34.87142
               2  |   37.20694    .533968      36.15876    38.25511
               3  |   38.55305   .4589223      37.65219    39.45391
               4  |   39.36879   .4055293      38.57274    40.16484
               5  |   39.29364   1.107082      37.12045    41.46683
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_bsa |   37.16905   .2164376      36.74458    37.59353
--------------------------------------------------------------
inwork
3
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      1,594
Number of PSUs   = 1,594                    Population size = 454,446.51
                                            Design df       =      1,593

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_bsa@pct |
                    1  |   .8074215   .0150935      .7778163    .8370267
                    2  |   .9302404   .0067687      .9169639     .943517
                    3  |   .9533963   .0071781      .9393168    .9674758
                    4  |   .9787452   .0028316      .9731912    .9842992
                    5  |   .9593752   .0087616      .9421897    .9765606
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |    .927777    .004523      .9189053    .9366488
------------------------------------------------------------------
3
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                      Number of obs   =        786
Number of PSUs   = 786                      Population size = 194,630.01
                                            Design df       =        785

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_bsa@pct |
                    1  |   .8290611   .0215243      .7868091     .871313
                    2  |   .9306096   .0111808      .9086617    .9525575
                    3  |   .9606988   .0088474      .9433315     .978066
                    4  |    .976641   .0076448      .9616343    .9916477
                    5  |   .9556749   .0206737      .9150927    .9962571
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,951
Number of PSUs   = 1,951              Population size = 483,326.56
                                      Design df       =      1,950

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_bsa |   .9238194   .0044431      .9151057    .9325331
------------------------------------------------------------------
h
4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1               Number of obs   =      1,594
Number of PSUs   = 1,594               Population size = 454,446.51
                                       Design df       =      1,593

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_tin@pct |
               1  |   33.04067   .6606273      31.74488    34.33646
               2  |   38.08438   .4515554      37.19867    38.97008
               3  |   39.40802   .4581855      38.50931    40.30673
               4  |   40.01823   .2291274       39.5688    40.46765
               5  |     39.604   .4829526      38.65671    40.55129
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   38.11815   .2271248      37.67265    38.56364
--------------------------------------------------------------
4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                 Number of obs   =        786
Number of PSUs   = 786                 Population size = 194,630.01
                                       Design df       =        785

-------------------------------------------------------------------
                  |             Linearized
                  |       Mean   std. err.     [95% conf. interval]
------------------+------------------------------------------------
c.h_p2022_tin@pct |
               1  |   33.28465   .9234104      31.47201     35.0973
               2  |   37.42529   .5286418      36.38757    38.46301
               3  |   38.72734   .4337164      37.87596    39.57872
               4  |   39.46238    .399469      38.67823    40.24654
               5  |   39.24558   1.144585      36.99877    41.49239
-------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
 h_p2022_tin |   37.25721   .2178801      36.82991    37.68451
--------------------------------------------------------------
inwork
4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                    Number of obs   =      1,594
Number of PSUs   = 1,594                    Population size = 454,446.51
                                            Design df       =      1,593

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_tin@pct |
                    1  |   .8142574   .0148818      .7850674    .8434474
                    2  |   .9332194   .0065857      .9203019     .946137
                    3  |   .9550255   .0071121      .9410754    .9689756
                    4  |   .9793834   .0028591      .9737753    .9849915
                    5  |    .956233   .0092551      .9380795    .9743865
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9294007   .0044855      .9206025    .9381988
------------------------------------------------------------------
4
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                      Number of obs   =        786
Number of PSUs   = 786                      Population size = 194,630.01
                                            Design df       =        785

------------------------------------------------------------------------
                       |             Linearized
                       |       Mean   std. err.     [95% conf. interval]
-----------------------+------------------------------------------------
c.inwork_p2022_tin@pct |
                    1  |   .8337585   .0212883      .7919696    .8755473
                    2  |   .9345857   .0109317      .9131268    .9560445
                    3  |   .9636609    .008062      .9478352    .9794865
                    4  |   .9777132     .00745      .9630889    .9923376
                    5  |   .9536654   .0215702      .9113234    .9960075
------------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,951
Number of PSUs   = 1,951              Population size = 483,326.56
                                      Design df       =      1,950

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
inwork_p2022_tin |   .9251478   .0044572      .9164064    .9338891
------------------------------------------------------------------
h
5
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1              Number of obs   =      1,594
Number of PSUs   = 1,594              Population size = 454,446.51
                                      Design df       =      1,593

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
c.h_p2022_cb@pct |
              1  |   32.87373   .6554184      31.58815     34.1593
              2  |    37.9508   .4460635      37.07587    38.82574
              3  |   39.31368   .4569507      38.41739    40.20997
              4  |   39.97396   .2283786      39.52601    40.42192
              5  |    39.7524   .4650197      38.84029    40.66452
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,594
Number of PSUs   = 1,594          Population size = 454,446.51
                                  Design df       =      1,593

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   38.06619   .2251371      37.62459    38.50778
--------------------------------------------------------------
5
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                Number of obs   =        786
Number of PSUs   = 786                Population size = 194,630.01
                                      Design df       =        785

------------------------------------------------------------------
                 |             Linearized
                 |       Mean   std. err.     [95% conf. interval]
-----------------+------------------------------------------------
c.h_p2022_cb@pct |
              1  |   33.15735   .9218363       31.3478    34.96691
              2  |   37.25086   .5297492      36.21097    38.29075
              3  |   38.58385   .4390715      37.72195    39.44574
              4  |   39.36484   .4058171      38.56823    40.16146
              5  |   39.28909   1.107824      37.11444    41.46373
------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1          Number of obs   =      1,951
Number of PSUs   = 1,951          Population size = 483,326.56
                                  Design df       =      1,950

--------------------------------------------------------------
             |             Linearized
             |       Mean   std. err.     [95% conf. interval]
-------------+------------------------------------------------
  h_p2022_cb |   37.18547   .2164176      36.76104    37.60991
--------------------------------------------------------------
inwork
5
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1                   Number of obs   =      1,594
Number of PSUs   = 1,594                   Population size = 454,446.51
                                           Design df       =      1,593

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.inwork_p2022_cb@pct |
                   1  |   .8108485   .0149113      .7816007    .8400963
                   2  |   .9307536   .0066981      .9176156    .9438917
                   3  |   .9534565   .0071737      .9393856    .9675275
                   4  |   .9787593   .0028251       .973218    .9843007
                   5  |   .9592694   .0087706      .9420662    .9764726
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,594
Number of PSUs   = 1,594             Population size = 454,446.51
                                     Design df       =      1,593

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9285186   .0044744      .9197422     .937295
-----------------------------------------------------------------
5
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =   1                     Number of obs   =        786
Number of PSUs   = 786                     Population size = 194,630.01
                                           Design df       =        785

-----------------------------------------------------------------------
                      |             Linearized
                      |       Mean   std. err.     [95% conf. interval]
----------------------+------------------------------------------------
c.inwork_p2022_cb@pct |
                   1  |   .8315237   .0213486      .7896166    .8734307
                   2  |   .9317902   .0110756      .9100489    .9535316
                   3  |   .9617675   .0082629      .9455475    .9779875
                   4  |   .9765013   .0076486      .9614871    .9915154
                   5  |   .9555731   .0206973      .9149444    .9962018
-----------------------------------------------------------------------
(running mean on estimation sample)

Survey: Mean estimation

Number of strata =     1             Number of obs   =      1,951
Number of PSUs   = 1,951             Population size = 483,326.56
                                     Design df       =      1,950

-----------------------------------------------------------------
                |             Linearized
                |       Mean   std. err.     [95% conf. interval]
----------------+------------------------------------------------
inwork_p2022_cb |   .9242606   .0044294      .9155737    .9329475
-----------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  R:\B2\01 - Households\10 - Labour supply model\02 - Working area\02 - Training\EURO
> LAB 1.0\do\../log//7_predict_lt_2019_3ch.log
  log type:  text
 closed on:   6 Dec 2022, 21:44:12
------------------------------------------------------------------------------------------------
