------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  R:\B2\01 - Households\10 - Labour supply model\02 - Working area\02 - Training\EURO
> LAB 1.0\do\../log//clogit_ch_lt_2019.log
  log type:  text
 opened on:   6 Dec 2022, 21:43:02

. 
. //Merge dataset with sampling design                                    
. use "${path_LSscen}/0_fullsample/${country}_${year}_${choices}ch_originalsample.dta" , clear

.         
. merge m:1  idper using "${path_LS}/baseline/${country}_${year}_${choices}ch_baseline_full.dta"

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            11,356  (_merge==3)
    -----------------------------------------

.         
. svyset psu1 [pw=dwt],strata(strata1)

Sampling weights: dwt
             VCE: linearized
     Single unit: missing
        Strata 1: strata1
 Sampling unit 1: psu1
           FPC 1: <zero>

. 
. 
. local ref_exp = "p${pyear}_base" 

.                         
. foreach ref in `ref_exp'{ 
  2.         quiet gen ils_sic_`ref' = ils_sicee_`ref' + ils_sicse_`ref'+ ils_sicer_`ref' + ils_
> sicot_`ref'
  3.         local var_inc "dispy tax ben sic"
  4.                 foreach var in `var_inc'{ 
  5. 
.                 gen `var'_stat_`ref' = (ils_`var'_`ref')  
  6.                 }
  7.         quiet gen net_expend_stat_`ref' = tax_stat_`ref' + sic_stat_`ref' - ben_stat_`ref' 
>      
  8. }

. 
. capture keep idper idhh *stat*  psu1 strata1

.                 
. sort idper

. 
. merge idper using "${path_LSscen}/3_LS/${country}_${year}_${choices}ch_LS.dta"
(you are using old merge syntax; see [D] merge for new syntax)
variable idperson does not uniquely identify observations in
    ../data//LSscenarios//3_LS/lt_2019_3ch_LS.dta
(label poslbl already defined)

. 
. 
. // consumption variable, for estimation
. foreach s of local sex {
  2.     replace age_`s'  =  age_`s' / 10
  3.     replace age2_`s' = age2_`s' / 100
  4. }

. *keep if flex_hh == 1|flex_hh == 2|flex_hh == 3 
. ** Loop HH type
.   
. drop consum

. gen consum = .
(78,649 missing values generated)

. gen p_p${pyear}_base  = 0

. local py $policyyears

. 
. foreach var of varlist consum hhsize leis_m leis_f age_m age_f age2_m age2_f numch{
  2.         gen consum_`var' = .
  3. }
(78,649 missing values generated)
(78,649 missing values generated)
(78,649 missing values generated)
(78,649 missing values generated)
(78,649 missing values generated)
(78,649 missing values generated)
(78,649 missing values generated)
(78,649 missing values generated)
(78,649 missing values generated)

. 
. /*
> gen unconstraint_pt = (reason_pt==4|reason_pt==5|reason_pt==6)
> gen  d_p_m_unconst =  unconstraint_pt*d_p_m
> gen  d_p_f_unconst =  unconstraint_pt*d_p_f*/
. 
. local sex "m f"

. foreach g of local sex {
  2. 
.         *gen d_p_`g'_unconst = d_p_`g'*unconstraint_pt 
. 
.          if "`g'" == "m" {
  3.         local gender "Male"
  4.     }
  5.                  if "`g'" == "f" {
  6.         local gender "Female"
  7.     }
  8.         
.         label var d_in_`g' "In-work dummy  `gender' "
  9.         label var d_p_`g' "Part-time dummy - `gender'"
 10.         label var d_f_`g' "Full-time dummy - `gender'"
 11.         label var d_o_`g' "Over-time dummy - `gender'"
 12.         label var d_un_`g' "Unemployment dummy - `gender'"
 13.         label var d_un_`g' "Unemployment dummy - `gender'"
 14.         *label var d_p_`g'_unconst "Voluntary Part-time - `gender'"
. 
. 
.         if ${EmplStatus} ==2 {
 15. 
.                 label var emp_2_`g' "Self-employed dummy - `gender'"
 16.                 label var d_in_1_2_`g' "In-work dummy x Self-employed in sector 1 - `gender
> '"
 17.                 label var d_p_1_2_`g' "Part-time dummy x Self-employed in sector 1 - `gende
> r'"
 18.                 label var d_f_1_2_`g' "Full-time dummy x Selef-employed in sector 1 - `gend
> er'"
 19.         }
 20.         
.         label var leis_`g' "Leisure - `gender'"
 21.         label var leis_leis_`g' "Leisure square - `gender'"
 22.         label var leis_age_`g' "Leisure x age - `gender'"
 23.         label var leis_age2_`g' "Leisure x age square - `gender'"
 24.         label var leis_numch_`g' "Leisure x #children - `gender'"
 25.         label var leis_numch3_`g' "Leisure x #children < 3 year - `gender'"
 26.         label var leis_numch36_`g' "Leisure x #children 3-6 year - `gender'"
 27.         label var leis_mortgage_`g' "Leisure x Mortgage - `gender'"
 28.         label var leis_migrant_`g' "Leisure x Migrant - `gender'"
 29.         label var consum_leis_`g' "Net income x Leisure - `gender'"
 30. }

. 
. label var consum "Net income"

. label var consum_consum "Net income square"

. label var consum_hhsize "Net income x household size"

. label var consum_consum "Net income square"

. label var leis_m_f "Leisure Male x Leisure Female"

. 
. local min_interval = $min_hour

. local max_interval = $max_hour-$step

.         
. if $UNEMPLOYMENT == 0{
. label define alternatives 0 "Inactive"  
. }       

. if $UNEMPLOYMENT == 1{
. label define alternatives 0 "Inactive" 5 "Unemployed"   
. }        

. 
. forvalues x = `min_interval'($step)`max_interval'{
  2.                 di in r "`x'"
  3.                 local lab_l = `x'
  4.                 local lab_h = `x'+$step
  5.                 local lab `"`lab_l' - `lab_h'"'
  6.                 di in r "`lab'"
  7.                 gen d_alt_m`x' = (lhw_m_norand==`x') 
  8.                 gen d_alt_f`x' = (lhw_f_norand==`x') 
  9.         label define alternatives `lab_h' `"`lab'"', modify
 10. }
5
5 - 22
22
22 - 39
39
39 - 56

.         
. label values lhw_m_norand alternatives

. label values lhw_f_norand alternatives

. 
. foreach g in "m" "f" {                          
  2.         foreach name in "numch" "numch3" "numch36" "migrant" {
  3.                 generate d_`name'_`g' = d_in_`g'*`name'
  4.     }
  5. } 

. 
. /*education*/
. cap gen edc_L = ed_low

. cap gen edc_M = ed_middle

. cap gen edc_H = ed_high

. 
. gen edu = 1 if edc_L==1
(58,123 missing values generated)

. replace edu = 2 if edc_M ==1
(35,326 real changes made)

. replace edu = 3 if edc_H ==1
(22,797 real changes made)

. 
. gen age_group = (dag > 17 & dag < 30 )

. replace age_group = 3 if dag > 40
(44,254 real changes made)

. replace age_group = 2 if dag > 29 & dag < 41
(9,912 real changes made)

. 
. gen ch_group = numch>0

. 
. foreach g in "m" "f"{
  2.         quiet gen h_`g' = lhw_`g'
  3.         replace h_`g' = 0  if lhw_`g'_norand <= 5
  4.         gen d_E_`g' = d_in_`g'
  5.         gen d_I_`g' = d_out_`g'
  6.         gen d_U_`g' = d_un_`g'
  7.         gen d_all_`g' = d_E_`g' +d_I_`g'+d_U_`g' 
  8.         assert d_all_`g' ==1 if flex_`g'==1
  9. }  
(0 real changes made)
(0 real changes made)

. 
. replace lhw_choice = 0 if choice_g == 0 &  lhw_choice !=0
(8 real changes made)

. keep if flex_hh>0 & flex_hh<4
(11,697 observations deleted)

. label var ls "Observed Frequencies"

. 
. gen cons_base =.
(66,952 missing values generated)

.  foreach type in "couples"  "singm"  "singf"  {
  2. 
.         *set trace on
.          if "`type'" == "couples" {
  3.         local condition ""
  4.         local hh "_hh"
  5.                 local genders = "m f"
  6.         local condition "if inlist(flex_hh, 1) & flex_m ==1" 
  7.                 egen hstring_`type'= group(lhw_f_norand lhw_m_norand)
  8.                 *gen hstring_`type' = "F" + string(choice_hour_f) + "  " + "M" + string(cho
> ice_hour_m) /*in case of random hours alternatives*/
.                 *label variable hstring_`type' "high blood pressure"
.     }
  9.         
.         if "`type'" == "singm" {
 10.         local condition "" 
 11.         local hh "_hh"
 12.                 local genders = "m"
 13.                 local name = "Single Men"
 14.                 local letter = "D"
 15.         local condition "if inlist(flex_hh, 3) & flex_m == 1"
 16.                 egen hstring_`type'= group(lhw_m_norand)
 17.                 *gen hstring_`type' = string(choice_hour_m) /*in case of random hours alter
> natives*/
.     }
 18.         
.         if "`type'" == "singf" {
 19.         local condition ""
 20.                 local genders = "f"
 21.                 local name = "Single Women"
 22.                 local letter = "C"
 23.         local hh "_hh"
 24.         local condition "if inlist(flex_hh, 2) & flex_f == 1"
 25.                 egen hstring_`type'= group(lhw_f_norand)
 26.                 *gen hstring_`type' = string(choice_hour_f) /*in case of random hours alter
> natives*/
.     }
 27. 
.         local py $policyyears
 28.         di in r "ils_dispy_p${pyear}_base`hh'"
 29.         
.         quietly replace consum = max(ils_dispy_p${pyear}_base`hh'/ 4.333 , 0.01) `condition'
 30. *leis_mother_`g' leis_father_`g' leis_ed_high_`g' leis_ed_middle_`g' leis_migrant_EU_`g'  l
> eis_migrant_nonEU_`g'
.         /*generation of leisure related variables*/
.         foreach g in `genders'{
 31.                 local var_`g' "leis_`g' leis_leis_`g' leis_age_`g' leis_age2_`g'  leis_numc
> h_`g' leis_numch3_`g' leis_numch36_`g' leis_migrant_`g' leis_mortgage_`g'"  
 32.                 if "$country" == "lv"|"$country" == "cz"  {
 33.                         local peaks_`g' = ""    
 34.                 }
 35.                 else {
 36.                         local peaks_`g' = "d_p_`g'_unconst"     
 37.                         local peaks_`g' = ""    
 38.         
.                 }
 39.                 
.                 local peaks_`g' "`peaks_`g'' d_in_`g' d_p_`g' d_f_`g' d_o_`g'" 
 40. 
.                 di in r `peaks_`g''
 41.                 if $UNEMPLOYMENT == 1 {
 42.                         *local peaks_`g' "`peaks_`g'' d_un_`g'"
.                 }
 43.         } 
 44. 
.         foreach var of varlist consum hhsize leis_m leis_f{
 45.                 replace consum_`var' = `var'* consum 
 46.         }
 47.                 
.         if "`type'" == "couples" {
 48.                 display "`condition'"
 49.                 local consumption = "consum consum_consum consum_hhsize consum_leis_m consu
> m_leis_f"
 50. 
.                 local variables  "`peaks_m' `peaks_f'  `var_m' `var_f' leis_m_f `consumption'"
>   
 51.                 
.                 clogit ls `variables' `condition',group(idhh) 
 52. 
. *bootstrap, reps(5) cluster(idhh) or nodots seed(25654):  clogit ls `variables' `condition',gr
> oup(idhh)
.                 estimates store clogit_`type'_${country}_${year}
 53.                 estwrite clogit_`type'_${country}_${year} using "${path_results}/estimation
> /${country}_${year}_clogit_`type'_${choices}ch.sters", replace
 54.                         
.                 predict p_`type' `condition'
 55. 
.                 bys lhw_f_norand lhw_m_norand: sum p_`type' ls `condition' 
 56.                 *graph bar ls p_`type' `condition', over(hstring_`type', label(labsize(smal
> l) angle(90))) bargap(-30) title("${COUNTRY}") note("EUROMOD:  blablabla") saving("${outlog}/f
> it/simfit_`type'_${choices}ch_${country}.gph", replace)
. 
.                 replace p_p${pyear}_base = p_`type' `condition'
 57.                 
.                 bys idper lhw_f_norand: egen p_`type'_f = total(p_`type') `condition'
 58.                 bys idper lhw_f_norand: egen ls_ff = total(ls) `condition'
 59.                 
.                 bys idper lhw_m_norand: egen p_`type'_m = total(p_`type') `condition'
 60.                 bys idper lhw_m_norand: egen ls_mm = total(ls) `condition'
 61. 
.                 label var p_`type' "Predicted Probabilities"
 62.                 *bys lhw_f_norand: sum p_`type'_f ls_ff  `condition'
.                 asdoc by lhw_m_norand: sum p_`type'_m ls_mm  `condition', center col label tit
> le(\fs28 Table 2.A. The average of predicted probabilities and observed fractions across labou
> r supply alternatives - Women in Couple) statistics(mean) dec(6) save(${path_results2share}/${
> country}_${year}_${choices}ch/2-Model Prediction.rtf)  replace
 63.                 *bys lhw_m_norand: sum p_`type'_m ls_mm  `condition'
.                 asdoc by lhw_f_norand: sum p_`type'_f ls_ff  `condition', center col label tit
> le(\fs28 Table 2.B. The average of predicted probabilities and observed fractions across labou
> r supply alternatives -Men in Couple) statistics(mean) dec(6) save(${path_results2share}/${cou
> ntry}_${year}_${choices}ch/2-Model Prediction.rtf) append             
 64.                 
.                 drop p_`type' 
 65.                 quietly replace consum = max(ils_dispy_p${ryear}_base`hh'/ 4.333 , 0.01) `c
> ondition'
 66.                 predict p_`type' `condition'
 67.                 gen p_p${ryear}_base = p_`type'  `condition'
 68.                 drop ls_mm ls_ff 
 69.         } 
 70.   
.         if "`type'" != "couples" {
 71.                 display "`condition'"
 72.                 count `condition'                       
 73.                 local consumption "consum consum_consum consum_hhsize consum_leis_`genders'
> " 
 74.                 local variables "`peaks_`genders'' `var_`genders''  `consumption'"
 75. 
.                 clogit ls `variables' `condition',group(idhh) 
 76.                 *bootstrap, reps(10) strata(idhh) or nodots seed(25654):  clogit ls `variab
> les' `condition',group(idhh)
.                 estimates store clogit_`type'_${country}_${year}
 77.                 estwrite clogit_`type'_${country}_${year} using ///
>                         "${path_results}/estimation/${country}_${year}_clogit_`type'_${choices
> }ch.sters" ///
>                         , replace
 78.                         predict p_`type' `condition'
 79.                 replace p_p${pyear}_base = p_`type' `condition'
 80. 
.                 
.                 
.                 *graph bar ls p_`type' `condition', over(hstring_`type', label(labsize(small) 
> angle(90))) bargap(-30) title("${COUNTRY}") note("EUROMOD:  blablabla") saving("${outlog}/fit/
> simfit_`type'_${choices}ch_${country}.gph", replace)
.         /*goodness of fit*/
. 
.                 label var p_`type' "Predicted"
 81.                 
.                 bys idper lhw_`genders'_norand: egen p_`type'_`genders' = total(p_`type') `con
> dition'
 82.                 bys idper lhw_`genders'_norand: egen ls_`genders'`genders' = total(ls) `con
> dition'
 83.                 
.                 *bys lhw_f_norand: sum p_`type'_`genders' ls_`genders'`genders'  `condition'
.                 
.                 if "`type'" == "singm" {
 84.                 asdoc by lhw_f_norand: sum p_`type'_`genders' ls_`genders'`genders'  `condi
> tion', center col label title(\fs28 Table 2.`letter'. The average values of predicted probabil
> ities and observed fractions across labour supply alternatives - `name') dec(6) statistics(mea
> n) save(${path_results2share}/${country}_${year}_${choices}ch/2-Model Prediction.rtf) append
 85.                 }
 86.                 if "`type'" == "singf" {
 87.                     asdoc by lhw_m_norand: sum p_`type'_`genders' ls_`genders'`genders'  `c
> ondition', center col label title(\fs28 Table 2.`letter'. The average values of predicted prob
> abilities and observed fractions across labour supply alternatives - `name') dec(6) statistics
> (mean) save(${path_results2share}/${country}_${year}_${choices}ch/2-Model Prediction.rtf) appe
> nd
 88.                 }
 89.                 
.                 /*
>                 egen ID_`genders'= group(lhw_`genders'_norand sec_`genders' emp_stat_`genders'
> )
>                 asdoc by ID_`genders': sum p_`type' ls  `condition', center col label title(\f
> s28 Table 2.`letter'. The average of predicted probabilities and observed fractions across lab
> our supply alternatives - `name') dec(6) statistics(mean) save(${path_results2share}/${country
> }_${year}_${choices}ch/2-Model Prediction.rtf) append*/
.                 drop p_`type' 
 90.                 quietly replace consum = max(ils_dispy_p${ryear}_base`hh'/ 4.333 , 0.01) `c
> ondition'
 91.                 predict p_`type' `condition'
 92.                 replace p_p${ryear}_base = p_`type'  `condition'
 93.                 
.         }
 94. 
. 
. 
.         local var_ls = "h d_E d_I d_U"
 95.                         foreach s in `sex' { 
 96.                                 foreach var in `var_ls' {
 97.                                         if "`var'" != "h" {
 98.                                                 bys idhh:       egen `var'_`s'_`type' = tot
> al(`var'_`s' * p_`type')  `condition'
 99.                                         }
100.                                         if "`var'" == "h" {
101.                                                 bys idhh:       egen `var'_`s'_`type' = tot
> al(`var'_`s' * p_`type')  `condition'
102.                                         }
103.                                 }                       
104.                         }
105.                 bys idhh:       egen  cons_`type' = total(consum * p_p${ryear}_base)  `cond
> ition'
106.                 replace cons_base = cons_`type'  `condition'
107.                 
.                 
.                         
. }
ils_dispy_p2018_base_hh
0000
1010
(18,640 real changes made)
(18,640 real changes made)
(18,640 real changes made)
(18,640 real changes made)
if inlist(flex_hh, 1) & flex_m ==1

Iteration 0:   log likelihood = -1470.8357  
Iteration 1:   log likelihood = -1250.3368  
Iteration 2:   log likelihood = -1227.2373  
Iteration 3:   log likelihood = -1226.2882  
Iteration 4:   log likelihood = -1226.2853  
Iteration 5:   log likelihood = -1226.2853  

Conditional (fixed-effects) logistic regression        Number of obs =  18,640
                                                       LR chi2(32)   = 4007.56
                                                       Prob > chi2   =  0.0000
Log likelihood = -1226.2853                            Pseudo R2     =  0.6204

---------------------------------------------------------------------------------
             ls | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
         d_in_m |  -2.062605   .9168124    -2.25   0.024    -3.859524   -.2656855
          d_p_m |   .2534873   .9493984     0.27   0.789    -1.607299    2.114274
          d_f_m |  -.2209272   1.313331    -0.17   0.866    -2.795008    2.353154
          d_o_m |   3.056795   1.444286     2.12   0.034     .2260469    5.887543
         d_in_f |  -1.421141   .7198337    -1.97   0.048    -2.831989   -.0102925
          d_p_f |  -.0517735   .6408724    -0.08   0.936     -1.30786    1.204313
          d_f_f |   .3156336   .8715006     0.36   0.717    -1.392476    2.023743
          d_o_f |   2.542292   .9354127     2.72   0.007     .7089173    4.375668
         leis_m |   .0830246   .1047679     0.79   0.428    -.1223166    .2883659
    leis_leis_m |   .0000216   .0009234     0.02   0.981    -.0017883    .0018314
     leis_age_m |  -.0022942    .002974    -0.77   0.440    -.0081231    .0035348
    leis_age2_m |   .0000229   .0000308     0.74   0.457    -.0000375    .0000833
   leis_numch_m |  -.0047213   .0041987    -1.12   0.261    -.0129506    .0035081
  leis_numch3_m |  -.0306045   .0129635    -2.36   0.018    -.0560126   -.0051964
 leis_numch36_m |  -.0097418   .0114477    -0.85   0.395    -.0321789    .0126952
 leis_migrant_m |    .019513   .0275785     0.71   0.479    -.0345399     .073566
leis_mortgage_m |   .0002508   .0004972     0.50   0.614    -.0007238    .0012253
         leis_f |   .0566922   .0823525     0.69   0.491    -.1047157    .2181002
    leis_leis_f |  -7.78e-06   .0007252    -0.01   0.991    -.0014292    .0014136
     leis_age_f |  -.0025913    .002345    -1.11   0.269    -.0071873    .0020047
    leis_age2_f |   .0000342   .0000259     1.32   0.186    -.0000165     .000085
   leis_numch_f |  -.0019912   .0038632    -0.52   0.606    -.0095629    .0055805
  leis_numch3_f |   .0264463   .0093959     2.81   0.005     .0080308    .0448619
 leis_numch36_f |   .0096706   .0080593     1.20   0.230    -.0061254    .0254666
 leis_migrant_f |  -.0016997   .0287363    -0.06   0.953    -.0580217    .0546224
leis_mortgage_f |  -.0002207   .0004281    -0.52   0.606    -.0010598    .0006183
       leis_m_f |   .0005682   .0001756     3.24   0.001     .0002241    .0009123
         consum |   .0366581    .004051     9.05   0.000     .0287183     .044598
  consum_consum |  -9.75e-06   1.51e-06    -6.44   0.000    -.0000127   -6.79e-06
  consum_hhsize |  -.0016243   .0006828    -2.38   0.017    -.0029624   -.0002861
  consum_leis_m |  -.0000666   .0000249    -2.68   0.007    -.0001153   -.0000178
  consum_leis_f |   -.000027   .0000159    -1.70   0.090    -.0000582    4.20e-06
---------------------------------------------------------------------------------
(saving clogit_couples_lt_2019)
(file ../data/results//estimation/lt_2019_clogit_couples_3ch.sters saved)
(option pc1 assumed; probability of success given one success within group)
(48,312 missing values generated)

------------------------------------------------------------------------------------------------
-> lhw_f_norand = Inactive, lhw_m_norand = Inactive

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0236962    .0500022   4.46e-09   .6146844
          ls |      1,165    .0248927     .155865          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = Inactive, lhw_m_norand = 5 - 22

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0035777    .0053956   7.85e-08   .0414467
          ls |      1,165    .0034335    .0585203          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = Inactive, lhw_m_norand = 22 - 39

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165     .002559    .0033127   4.31e-07   .0302685
          ls |      1,165    .0017167    .0414157          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = Inactive, lhw_m_norand = 39 - 56

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0808967    .0943993   .0000154   .6941961
          ls |      1,165    .0806867    .2724703          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 5 - 22, lhw_m_norand = Inactive

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0040159    .0057319   2.17e-08   .0494014
          ls |      1,165    .0017167    .0414157          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 5 - 22, lhw_m_norand = 5 - 22

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0008524    .0007223   2.21e-07   .0053503
          ls |      1,165    .0034335    .0585203          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 5 - 22, lhw_m_norand = 22 - 39

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0007654    .0004933   3.55e-06   .0046338
          ls |      1,165    .0025751    .0507019          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 5 - 22, lhw_m_norand = 39 - 56

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165     .028701    .0164556   .0000866   .1777288
          ls |      1,165    .0266094    .1610082          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 22 - 39, lhw_m_norand = Inactive

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0052065    .0065452   2.93e-08   .0586188
          ls |      1,165    .0034335    .0585203          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 22 - 39, lhw_m_norand = 5 - 22

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0013667    .0009311   2.91e-07   .0061168
          ls |      1,165    .0008584    .0292979          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 22 - 39, lhw_m_norand = 22 - 39

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0014457    .0005851   .0000157   .0035711
          ls |      1,165    .0017167    .0414157          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 22 - 39, lhw_m_norand = 39 - 56

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0606506    .0153312   .0033778   .1193658
          ls |      1,165    .0626609    .2424562          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 39 - 56, lhw_m_norand = Inactive

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0469097    .0569454   2.50e-07   .4014041
          ls |      1,165    .0497854    .2175947          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 39 - 56, lhw_m_norand = 5 - 22

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0138483    .0091367   2.54e-06   .0544642
          ls |      1,165    .0111588    .1050893          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 39 - 56, lhw_m_norand = 22 - 39

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .0159281    .0060886   .0001467   .0286005
          ls |      1,165    .0154506    .1233896          0          1

------------------------------------------------------------------------------------------------
-> lhw_f_norand = 39 - 56, lhw_m_norand = 39 - 56

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   p_couples |      1,165    .7095799    .1566195   .0550462   .9756465
          ls |      1,165    .7098712    .4540165          0          1

(18,640 real changes made)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
lhw_m_norand

             | p_coupl~m      ls_mm 
-------------+----------------------
    Inactive |  .0798283   .0798283 
      5_-_22 |   .019645   .0188841 
     22_-_39 |  .0206983   .0214592 
     39_-_56 |  .8798283   .8798283 
(file ../results//lt_2019_3ch/2-Model Prediction.rtf not found)
Click to Open File:  ../results//lt_2019_3ch/2-Model Prediction.rtf
lhw_f_norand

             | p_coupl~f      ls_ff 
-------------+----------------------
    Inactive |  .1107296   .1107296 
      5_-_22 |  .0343348   .0343348 
     22_-_39 |  .0686695   .0686695 
     39_-_56 |  .7862661   .7862661 
Click to Open File:  ../results//lt_2019_3ch/2-Model Prediction.rtf
(option pc1 assumed; probability of success given one success within group)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(48,312 missing values generated)
(18,640 real changes made)
ils_dispy_p2018_base_hh
0000
(20,079 real changes made)
(20,079 real changes made)
(20,079 real changes made)
(20,079 real changes made)
if inlist(flex_hh, 3) & flex_m == 1
  1,716

Iteration 0:   log likelihood = -321.53117  
Iteration 1:   log likelihood =  -285.5356  
Iteration 2:   log likelihood = -254.05317  
Iteration 3:   log likelihood = -253.39985  
Iteration 4:   log likelihood = -247.90974  
Iteration 5:   log likelihood = -247.39183  
Iteration 6:   log likelihood = -247.33899  
Iteration 7:   log likelihood = -247.33897  

Conditional (fixed-effects) logistic regression         Number of obs =  1,716
                                                        LR chi2(17)   = 694.76
                                                        Prob > chi2   = 0.0000
Log likelihood = -247.33897                             Pseudo R2     = 0.5841

---------------------------------------------------------------------------------
             ls | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
         d_in_m |  -.8675392   1.006748    -0.86   0.389    -2.840729     1.10565
          d_p_m |   .2407893   1.103079     0.22   0.827    -1.921205    2.402784
          d_f_m |   .8508799   1.734466     0.49   0.624    -2.548611    4.250371
          d_o_m |   4.375317   1.940483     2.25   0.024     .5720406    8.178593
         leis_m |  -.0795611   .1121623    -0.71   0.478    -.2993951    .1402729
    leis_leis_m |   .0011068   .0012652     0.87   0.382     -.001373    .0035866
     leis_age_m |   .0032219    .002003     1.61   0.108    -.0007038    .0071476
    leis_age2_m |  -.0000375   .0000239    -1.57   0.116    -.0000843    9.25e-06
   leis_numch_m |  -.0223998   .0149114    -1.50   0.133    -.0516256    .0068261
  leis_numch3_m |   .0273613   .0375264     0.73   0.466     -.046189    .1009116
 leis_numch36_m |   .1195252   .0455573     2.62   0.009     .0302346    .2088159
 leis_migrant_m |   .0964023   .0625167     1.54   0.123    -.0261281    .2189328
leis_mortgage_m |  -.0033374   .0013322    -2.51   0.012    -.0059485   -.0007262
         consum |   .0575813   .0086982     6.62   0.000     .0405331    .0746295
  consum_consum |  -.0000374   5.86e-06    -6.39   0.000    -.0000489    -.000026
  consum_hhsize |   .0003785   .0015786     0.24   0.811    -.0027155    .0034724
  consum_leis_m |  -.0002487   .0000602    -4.13   0.000    -.0003668   -.0001306
---------------------------------------------------------------------------------
(saving clogit_singm_lt_2019)
(file ../data/results//estimation/lt_2019_clogit_singm_3ch.sters saved)
(option pc1 assumed; probability of success given one success within group)
(65,236 missing values generated)
(1,716 real changes made)
(65,236 missing values generated)
(65,236 missing values generated)
lhw_f_norand

             | p_singm_m      ls_mm 
-------------+----------------------
    Inactive |  .2440542   .2574032 
      5_-_22 |  .2657112   .2216981 
     22_-_39 |   .244678   .2630332 
     39_-_56 |  .2458111   .2575406 
Click to Open File:  ../results//lt_2019_3ch/2-Model Prediction.rtf
(option pc1 assumed; probability of success given one success within group)
(65,236 missing values generated)
(1,716 real changes made)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(65,236 missing values generated)
(1,716 real changes made)
ils_dispy_p2018_base_hh
1010
(4,735 real changes made)
(4,735 real changes made)
(4,735 real changes made)
(4,735 real changes made)
if inlist(flex_hh, 2) & flex_f == 1
  3,144

Iteration 0:   log likelihood = -638.07215  
Iteration 1:   log likelihood =  -475.7585  
Iteration 2:   log likelihood = -464.53728  
Iteration 3:   log likelihood = -464.07256  
Iteration 4:   log likelihood = -464.06279  
Iteration 5:   log likelihood = -464.06271  
Iteration 6:   log likelihood = -464.06271  

Conditional (fixed-effects) logistic regression        Number of obs =   3,144
                                                       LR chi2(17)   = 1251.13
                                                       Prob > chi2   =  0.0000
Log likelihood = -464.06271                            Pseudo R2     =  0.5741

---------------------------------------------------------------------------------
             ls | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
         d_in_f |   -2.00592   1.050327    -1.91   0.056    -4.064523    .0526833
          d_p_f |  -.1970219   .8521927    -0.23   0.817    -1.867289    1.473245
          d_f_f |  -.1812961   1.137618    -0.16   0.873    -2.410986    2.048393
          d_o_f |    2.34908   1.220997     1.92   0.054    -.0440302     4.74219
         leis_f |   .0184915   .0976625     0.19   0.850    -.1729234    .2099064
    leis_leis_f |   -.000502   .0009627    -0.52   0.602    -.0023889    .0013848
     leis_age_f |   .0027187   .0023807     1.14   0.253    -.0019473    .0073848
    leis_age2_f |  -.0000262   .0000267    -0.98   0.326    -.0000786    .0000261
   leis_numch_f |   .0048851   .0047608     1.03   0.305    -.0044459    .0142162
  leis_numch3_f |  -.0181992   .0159415    -1.14   0.254    -.0494441    .0130456
 leis_numch36_f |   .0095158   .0154412     0.62   0.538    -.0207483      .03978
 leis_migrant_f |  -.0091828   .0311152    -0.30   0.768    -.0701674    .0518019
leis_mortgage_f |  -.0005343   .0007059    -0.76   0.449    -.0019178    .0008492
         consum |   .0210297   .0062101     3.39   0.001      .008858    .0332013
  consum_consum |  -.0000101   5.39e-06    -1.87   0.062    -.0000206    5.00e-07
  consum_hhsize |    .005406    .001977     2.73   0.006     .0015312    .0092808
  consum_leis_f |   .0000877   .0000485     1.81   0.071    -7.43e-06    .0001829
---------------------------------------------------------------------------------
(saving clogit_singf_lt_2019)
(file ../data/results//estimation/lt_2019_clogit_singf_3ch.sters saved)
(option pc1 assumed; probability of success given one success within group)
(63,808 missing values generated)
(3,144 real changes made)
(63,808 missing values generated)
(63,808 missing values generated)
lhw_m_norand

             | p_singf_f      ls_ff 
-------------+----------------------
    Inactive |  .2509329   .2667526 
      5_-_22 |  .2587196   .2587322 
     22_-_39 |  .2511513   .2368742 
     39_-_56 |  .2391662   .2384021 
Click to Open File:  ../results//lt_2019_3ch/2-Model Prediction.rtf
(option pc1 assumed; probability of success given one success within group)
(63,808 missing values generated)
(3,144 real changes made)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(63,808 missing values generated)
(3,144 real changes made)

. 
. 
. 
. 
. save "${path_LSscen}/4_pred/${country}_${year}_${choices}ch_pred_LS.dta", replace
file ../data//LSscenarios//4_pred/lt_2019_3ch_pred_LS.dta saved

. 
. 
. local sex "m f"

. 
.         foreach name in `var_ls'{
  2.                 quietly gen `name'_base = .
  3.                 foreach s in `sex'{ 
  4.                         bysort idhh lhw_m_norand lhw_f_norand sec_m sec_f emp_stat_m emp_st
> at_f: egen double `name'_`s'_base = total(`name'_`s'_couples)
  5.                         quietly replace `name'_base = `name'_`s'_base if flex_hh == 1 & fle
> x_`s'==1
  6.                         quietly replace `name'_base = `name'_`s'_sing`s' if flex_`s' ==1 & 
> flex_hh!=1 
  7.                         
.                 }
  8.         }                       

. 
. 
. keep if  ls ==1 & flex_hh >0 & flex_hh <4
(63,407 observations deleted)

. 
. foreach var in "d_E" "d_I" "d_U"{
  2.         
.                 gen `var'_new = `var'_base * dwt 
  3.                 total `var'_new
  4.                 scalar demand_`var'_base = e(b)[1,1]
  5.                 di in r "demand_`var'_base"
  6.                 scalar list demand_`var'_base
  7. 
. }       

Total estimation                         Number of obs = 3,545

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
     d_E_new |     890043   14845.33      860936.7    919149.2
--------------------------------------------------------------
demand_d_E_base
demand_d_E_base =  890042.97

Total estimation                         Number of obs = 3,545

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
     d_I_new |    47730.1   2664.511      42505.97    52954.23
--------------------------------------------------------------
demand_d_I_base
demand_d_I_base =    47730.1

Total estimation                         Number of obs = 3,545

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
     d_U_new |          0  (omitted)
--------------------------------------------------------------
demand_d_U_base
demand_d_U_base =          0

. 
. total dwt

Total estimation                         Number of obs = 3,545

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
         dwt |   937773.1   15423.39      907533.5    968012.7
--------------------------------------------------------------

. scalar demand_tot_base = e(b)[1,1]

. scalar list demand_tot_base
demand_tot_base =  937773.07

. 
. scalar demand_tot_base = demand_d_E_base+demand_d_I_base

. scalar list demand_tot_base
demand_tot_base =  937773.07

. 
. 
. label var ls "clogit dependent variable"

. estout clogit_couples_${country}_${year} clogit_singf_${country}_${year} clogit_singm_${countr
> y}_${year}

---------------------------------------------------
             clogit_~2019 clogit_~2019 clogit_~2019
                        b            b            b
---------------------------------------------------
ls                                                 
d_in_m          -2.062605                 -.8675392
d_p_m            .2534873                  .2407893
d_f_m           -.2209272                  .8508799
d_o_m            3.056795                  4.375317
d_in_f          -1.421141     -2.00592             
d_p_f           -.0517735    -.1970219             
d_f_f            .3156336    -.1812961             
d_o_f            2.542292      2.34908             
leis_m           .0830246                 -.0795611
leis_leis_m      .0000216                  .0011068
leis_age_m      -.0022942                  .0032219
leis_age2_m      .0000229                 -.0000375
leis_numch_m    -.0047213                 -.0223998
leis_num~3_m    -.0306045                  .0273613
leis_num~6_m    -.0097418                  .1195252
leis_migra~m      .019513                  .0964023
leis_mortg~m     .0002508                 -.0033374
leis_f           .0566922     .0184915             
leis_leis_f     -7.78e-06     -.000502             
leis_age_f      -.0025913     .0027187             
leis_age2_f      .0000342    -.0000262             
leis_numch_f    -.0019912     .0048851             
leis_num~3_f     .0264463    -.0181992             
leis_num~6_f     .0096706     .0095158             
leis_migra~f    -.0016997    -.0091828             
leis_mortg~f    -.0002207    -.0005343             
leis_m_f         .0005682                          
consum           .0366581     .0210297     .0575813
consum_con~m    -9.75e-06    -.0000101    -.0000374
consum_hhs~e    -.0016243      .005406     .0003785
consum_lei~m    -.0000666                 -.0002487
consum_lei~f     -.000027     .0000877             
---------------------------------------------------

. esttab clogit_couples_${country}_${year} clogit_singf_${country}_${year} clogit_singm_${countr
> y}_${year} using "${path_results2share}/${country}_${year}_${choices}ch/2-Utility_parameters.r
> tf", replace label title({\b Table 1: Conditional Logit results })  nonumbers mtitles("Couples
> " "Single Women" "Single Men") scalars(N ll r2_p aic bic ) 
(file ../results//lt_2019_3ch/2-Utility_parameters.rtf not found)
(output written to ../results//lt_2019_3ch/2-Utility_parameters.rtf)

. 
. 
. 
end of do-file

. *********************************************************************************
. * 7_predict.do                                                                                
>                                                   *
. *                                                                                             
>                                                                   *
. * Takes estimates of ls estimation and predicts expected hours from there               *
. * Last Update: 15/07/2021 E.N.                                                                
>                                   *
. ********************************************************************************* 
.   
. capture log close
